konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/accessctrl.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : ACCESSCTRL
# Version        : 1
# Bus type       : apb
# Description    : Hardware access control registers
# =============================================================================
.ifndef	_HARDWARE_REGS_ACCESSCTRL_H
.set	_HARDWARE_REGS_ACCESSCTRL_H, 1
# =============================================================================
# Register    : ACCESSCTRL_LOCK
# Description : Once a LOCK bit is written to 1, ACCESSCTRL silently ignores
#               writes from that master. LOCK is writable only by a Secure,
#               Privileged processor or debugger.
#
#               LOCK bits are only writable when their value is zero. Once set,
#               they can never be cleared, except by a full reset of ACCESSCTRL
#
#               Setting the LOCK bit does not affect whether an access raises a
#               bus error. Unprivileged writes, or writes from the DMA, will
#               continue to raise bus errors. All other accesses will continue
#               not to.
.equ	ACCESSCTRL_LOCK_OFFSET, 0x00000000
.equ	ACCESSCTRL_LOCK_BITS, 0x0000000f
.equ	ACCESSCTRL_LOCK_RESET, 0x00000004
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_LOCK_DEBUG
.equ	ACCESSCTRL_LOCK_DEBUG_RESET, 0x0
.equ	ACCESSCTRL_LOCK_DEBUG_BITS, 0x00000008
.equ	ACCESSCTRL_LOCK_DEBUG_MSB, 3
.equ	ACCESSCTRL_LOCK_DEBUG_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_LOCK_DMA
.equ	ACCESSCTRL_LOCK_DMA_RESET, 0x1
.equ	ACCESSCTRL_LOCK_DMA_BITS, 0x00000004
.equ	ACCESSCTRL_LOCK_DMA_MSB, 2
.equ	ACCESSCTRL_LOCK_DMA_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_LOCK_CORE1
.equ	ACCESSCTRL_LOCK_CORE1_RESET, 0x0
.equ	ACCESSCTRL_LOCK_CORE1_BITS, 0x00000002
.equ	ACCESSCTRL_LOCK_CORE1_MSB, 1
.equ	ACCESSCTRL_LOCK_CORE1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_LOCK_CORE0
.equ	ACCESSCTRL_LOCK_CORE0_RESET, 0x0
.equ	ACCESSCTRL_LOCK_CORE0_BITS, 0x00000001
.equ	ACCESSCTRL_LOCK_CORE0_MSB, 0
.equ	ACCESSCTRL_LOCK_CORE0_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_FORCE_CORE_NS
# Description : Force core 1's bus accesses to always be Non-secure, no matter
#               the core's internal state.
#
#               Useful for schemes where one core is designated as the Non-
#               secure core, since some peripherals may filter individual
#               registers internally based on security state but not on master
#               ID.
.equ	ACCESSCTRL_FORCE_CORE_NS_OFFSET, 0x00000004
.equ	ACCESSCTRL_FORCE_CORE_NS_BITS, 0x00000002
.equ	ACCESSCTRL_FORCE_CORE_NS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_FORCE_CORE_NS_CORE1
.equ	ACCESSCTRL_FORCE_CORE_NS_CORE1_RESET, 0x0
.equ	ACCESSCTRL_FORCE_CORE_NS_CORE1_BITS, 0x00000002
.equ	ACCESSCTRL_FORCE_CORE_NS_CORE1_MSB, 1
.equ	ACCESSCTRL_FORCE_CORE_NS_CORE1_LSB, 1
# =============================================================================
# Register    : ACCESSCTRL_CFGRESET
# Description : Write 1 to reset all ACCESSCTRL configuration, except for the
#               LOCK and FORCE_CORE_NS registers.
#
#               This bit is used in the RP2350 bootrom to quickly restore
#               ACCESSCTRL to a known state during the boot path.
#
#               Note that, like all registers in ACCESSCTRL, this register is
#               not writable when the writer's corresponding LOCK bit is set,
#               therefore a master which has been locked out of ACCESSCTRL can
#               not use the CFGRESET register to disturb its contents.
.equ	ACCESSCTRL_CFGRESET_OFFSET, 0x00000008
.equ	ACCESSCTRL_CFGRESET_BITS, 0x00000001
.equ	ACCESSCTRL_CFGRESET_RESET, 0x00000000
.equ	ACCESSCTRL_CFGRESET_MSB, 0
.equ	ACCESSCTRL_CFGRESET_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_GPIO_NSMASK0
# Description : Control whether GPIO0...31 are accessible to Non-secure code.
#               Writable only by a Secure, Privileged processor or debugger.
#
#               0 -> Secure access only
#
#               1 -> Secure + Non-secure access
.equ	ACCESSCTRL_GPIO_NSMASK0_OFFSET, 0x0000000c
.equ	ACCESSCTRL_GPIO_NSMASK0_BITS, 0xffffffff
.equ	ACCESSCTRL_GPIO_NSMASK0_RESET, 0x00000000
.equ	ACCESSCTRL_GPIO_NSMASK0_MSB, 31
.equ	ACCESSCTRL_GPIO_NSMASK0_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_GPIO_NSMASK1
# Description : Control whether GPIO32..47 are accessible to Non-secure code,
#               and whether QSPI and USB bitbang are accessible through the
#               Non-secure SIO. Writable only by a Secure, Privileged processor
#               or debugger.
.equ	ACCESSCTRL_GPIO_NSMASK1_OFFSET, 0x00000010
.equ	ACCESSCTRL_GPIO_NSMASK1_BITS, 0xff00ffff
.equ	ACCESSCTRL_GPIO_NSMASK1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_GPIO_NSMASK1_QSPI_SD
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_RESET, 0x0
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_BITS, 0xf0000000
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_MSB, 31
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_LSB, 28
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_RESET, 0x0
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_BITS, 0x08000000
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_MSB, 27
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN_LSB, 27
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_RESET, 0x0
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_BITS, 0x04000000
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_MSB, 26
.equ	ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK_LSB, 26
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_GPIO_NSMASK1_USB_DM
.equ	ACCESSCTRL_GPIO_NSMASK1_USB_DM_RESET, 0x0
.equ	ACCESSCTRL_GPIO_NSMASK1_USB_DM_BITS, 0x02000000
.equ	ACCESSCTRL_GPIO_NSMASK1_USB_DM_MSB, 25
.equ	ACCESSCTRL_GPIO_NSMASK1_USB_DM_LSB, 25
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_GPIO_NSMASK1_USB_DP
.equ	ACCESSCTRL_GPIO_NSMASK1_USB_DP_RESET, 0x0
.equ	ACCESSCTRL_GPIO_NSMASK1_USB_DP_BITS, 0x01000000
.equ	ACCESSCTRL_GPIO_NSMASK1_USB_DP_MSB, 24
.equ	ACCESSCTRL_GPIO_NSMASK1_USB_DP_LSB, 24
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_GPIO_NSMASK1_GPIO
.equ	ACCESSCTRL_GPIO_NSMASK1_GPIO_RESET, 0x0000
.equ	ACCESSCTRL_GPIO_NSMASK1_GPIO_BITS, 0x0000ffff
.equ	ACCESSCTRL_GPIO_NSMASK1_GPIO_MSB, 15
.equ	ACCESSCTRL_GPIO_NSMASK1_GPIO_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_ROM
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               ROM, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_ROM_OFFSET, 0x00000014
.equ	ACCESSCTRL_ROM_BITS, 0x000000ff
.equ	ACCESSCTRL_ROM_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROM_DBG
# Description : If 1, ROM can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_ROM_DBG_RESET, 0x1
.equ	ACCESSCTRL_ROM_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_ROM_DBG_MSB, 7
.equ	ACCESSCTRL_ROM_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROM_DMA
# Description : If 1, ROM can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_ROM_DMA_RESET, 0x1
.equ	ACCESSCTRL_ROM_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_ROM_DMA_MSB, 6
.equ	ACCESSCTRL_ROM_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROM_CORE1
# Description : If 1, ROM can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_ROM_CORE1_RESET, 0x1
.equ	ACCESSCTRL_ROM_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_ROM_CORE1_MSB, 5
.equ	ACCESSCTRL_ROM_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROM_CORE0
# Description : If 1, ROM can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_ROM_CORE0_RESET, 0x1
.equ	ACCESSCTRL_ROM_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_ROM_CORE0_MSB, 4
.equ	ACCESSCTRL_ROM_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROM_SP
# Description : If 1, ROM can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_ROM_SP_RESET, 0x1
.equ	ACCESSCTRL_ROM_SP_BITS, 0x00000008
.equ	ACCESSCTRL_ROM_SP_MSB, 3
.equ	ACCESSCTRL_ROM_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROM_SU
# Description : If 1, and SP is also set, ROM can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_ROM_SU_RESET, 0x1
.equ	ACCESSCTRL_ROM_SU_BITS, 0x00000004
.equ	ACCESSCTRL_ROM_SU_MSB, 2
.equ	ACCESSCTRL_ROM_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROM_NSP
# Description : If 1, ROM can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_ROM_NSP_RESET, 0x1
.equ	ACCESSCTRL_ROM_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_ROM_NSP_MSB, 1
.equ	ACCESSCTRL_ROM_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROM_NSU
# Description : If 1, and NSP is also set, ROM can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_ROM_NSU_RESET, 0x1
.equ	ACCESSCTRL_ROM_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_ROM_NSU_MSB, 0
.equ	ACCESSCTRL_ROM_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_XIP_MAIN
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               XIP_MAIN, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_XIP_MAIN_OFFSET, 0x00000018
.equ	ACCESSCTRL_XIP_MAIN_BITS, 0x000000ff
.equ	ACCESSCTRL_XIP_MAIN_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_MAIN_DBG
# Description : If 1, XIP_MAIN can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_XIP_MAIN_DBG_RESET, 0x1
.equ	ACCESSCTRL_XIP_MAIN_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_XIP_MAIN_DBG_MSB, 7
.equ	ACCESSCTRL_XIP_MAIN_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_MAIN_DMA
# Description : If 1, XIP_MAIN can be accessed by the DMA, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_XIP_MAIN_DMA_RESET, 0x1
.equ	ACCESSCTRL_XIP_MAIN_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_XIP_MAIN_DMA_MSB, 6
.equ	ACCESSCTRL_XIP_MAIN_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_MAIN_CORE1
# Description : If 1, XIP_MAIN can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XIP_MAIN_CORE1_RESET, 0x1
.equ	ACCESSCTRL_XIP_MAIN_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_XIP_MAIN_CORE1_MSB, 5
.equ	ACCESSCTRL_XIP_MAIN_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_MAIN_CORE0
# Description : If 1, XIP_MAIN can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XIP_MAIN_CORE0_RESET, 0x1
.equ	ACCESSCTRL_XIP_MAIN_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_XIP_MAIN_CORE0_MSB, 4
.equ	ACCESSCTRL_XIP_MAIN_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_MAIN_SP
# Description : If 1, XIP_MAIN can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_XIP_MAIN_SP_RESET, 0x1
.equ	ACCESSCTRL_XIP_MAIN_SP_BITS, 0x00000008
.equ	ACCESSCTRL_XIP_MAIN_SP_MSB, 3
.equ	ACCESSCTRL_XIP_MAIN_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_MAIN_SU
# Description : If 1, and SP is also set, XIP_MAIN can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_XIP_MAIN_SU_RESET, 0x1
.equ	ACCESSCTRL_XIP_MAIN_SU_BITS, 0x00000004
.equ	ACCESSCTRL_XIP_MAIN_SU_MSB, 2
.equ	ACCESSCTRL_XIP_MAIN_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_MAIN_NSP
# Description : If 1, XIP_MAIN can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_XIP_MAIN_NSP_RESET, 0x1
.equ	ACCESSCTRL_XIP_MAIN_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_XIP_MAIN_NSP_MSB, 1
.equ	ACCESSCTRL_XIP_MAIN_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_MAIN_NSU
# Description : If 1, and NSP is also set, XIP_MAIN can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_XIP_MAIN_NSU_RESET, 0x1
.equ	ACCESSCTRL_XIP_MAIN_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_XIP_MAIN_NSU_MSB, 0
.equ	ACCESSCTRL_XIP_MAIN_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SRAM0
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SRAM0, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SRAM0_OFFSET, 0x0000001c
.equ	ACCESSCTRL_SRAM0_BITS, 0x000000ff
.equ	ACCESSCTRL_SRAM0_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM0_DBG
# Description : If 1, SRAM0 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SRAM0_DBG_RESET, 0x1
.equ	ACCESSCTRL_SRAM0_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SRAM0_DBG_MSB, 7
.equ	ACCESSCTRL_SRAM0_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM0_DMA
# Description : If 1, SRAM0 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM0_DMA_RESET, 0x1
.equ	ACCESSCTRL_SRAM0_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SRAM0_DMA_MSB, 6
.equ	ACCESSCTRL_SRAM0_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM0_CORE1
# Description : If 1, SRAM0 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM0_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SRAM0_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SRAM0_CORE1_MSB, 5
.equ	ACCESSCTRL_SRAM0_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM0_CORE0
# Description : If 1, SRAM0 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM0_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SRAM0_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SRAM0_CORE0_MSB, 4
.equ	ACCESSCTRL_SRAM0_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM0_SP
# Description : If 1, SRAM0 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SRAM0_SP_RESET, 0x1
.equ	ACCESSCTRL_SRAM0_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SRAM0_SP_MSB, 3
.equ	ACCESSCTRL_SRAM0_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM0_SU
# Description : If 1, and SP is also set, SRAM0 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SRAM0_SU_RESET, 0x1
.equ	ACCESSCTRL_SRAM0_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SRAM0_SU_MSB, 2
.equ	ACCESSCTRL_SRAM0_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM0_NSP
# Description : If 1, SRAM0 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SRAM0_NSP_RESET, 0x1
.equ	ACCESSCTRL_SRAM0_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SRAM0_NSP_MSB, 1
.equ	ACCESSCTRL_SRAM0_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM0_NSU
# Description : If 1, and NSP is also set, SRAM0 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SRAM0_NSU_RESET, 0x1
.equ	ACCESSCTRL_SRAM0_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SRAM0_NSU_MSB, 0
.equ	ACCESSCTRL_SRAM0_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SRAM1
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SRAM1, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SRAM1_OFFSET, 0x00000020
.equ	ACCESSCTRL_SRAM1_BITS, 0x000000ff
.equ	ACCESSCTRL_SRAM1_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM1_DBG
# Description : If 1, SRAM1 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SRAM1_DBG_RESET, 0x1
.equ	ACCESSCTRL_SRAM1_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SRAM1_DBG_MSB, 7
.equ	ACCESSCTRL_SRAM1_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM1_DMA
# Description : If 1, SRAM1 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM1_DMA_RESET, 0x1
.equ	ACCESSCTRL_SRAM1_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SRAM1_DMA_MSB, 6
.equ	ACCESSCTRL_SRAM1_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM1_CORE1
# Description : If 1, SRAM1 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM1_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SRAM1_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SRAM1_CORE1_MSB, 5
.equ	ACCESSCTRL_SRAM1_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM1_CORE0
# Description : If 1, SRAM1 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM1_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SRAM1_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SRAM1_CORE0_MSB, 4
.equ	ACCESSCTRL_SRAM1_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM1_SP
# Description : If 1, SRAM1 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SRAM1_SP_RESET, 0x1
.equ	ACCESSCTRL_SRAM1_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SRAM1_SP_MSB, 3
.equ	ACCESSCTRL_SRAM1_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM1_SU
# Description : If 1, and SP is also set, SRAM1 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SRAM1_SU_RESET, 0x1
.equ	ACCESSCTRL_SRAM1_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SRAM1_SU_MSB, 2
.equ	ACCESSCTRL_SRAM1_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM1_NSP
# Description : If 1, SRAM1 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SRAM1_NSP_RESET, 0x1
.equ	ACCESSCTRL_SRAM1_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SRAM1_NSP_MSB, 1
.equ	ACCESSCTRL_SRAM1_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM1_NSU
# Description : If 1, and NSP is also set, SRAM1 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SRAM1_NSU_RESET, 0x1
.equ	ACCESSCTRL_SRAM1_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SRAM1_NSU_MSB, 0
.equ	ACCESSCTRL_SRAM1_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SRAM2
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SRAM2, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SRAM2_OFFSET, 0x00000024
.equ	ACCESSCTRL_SRAM2_BITS, 0x000000ff
.equ	ACCESSCTRL_SRAM2_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM2_DBG
