konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/accessctrl.inc
# Description : If 1, SRAM2 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SRAM2_DBG_RESET, 0x1
.equ	ACCESSCTRL_SRAM2_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SRAM2_DBG_MSB, 7
.equ	ACCESSCTRL_SRAM2_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM2_DMA
# Description : If 1, SRAM2 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM2_DMA_RESET, 0x1
.equ	ACCESSCTRL_SRAM2_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SRAM2_DMA_MSB, 6
.equ	ACCESSCTRL_SRAM2_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM2_CORE1
# Description : If 1, SRAM2 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM2_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SRAM2_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SRAM2_CORE1_MSB, 5
.equ	ACCESSCTRL_SRAM2_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM2_CORE0
# Description : If 1, SRAM2 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM2_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SRAM2_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SRAM2_CORE0_MSB, 4
.equ	ACCESSCTRL_SRAM2_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM2_SP
# Description : If 1, SRAM2 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SRAM2_SP_RESET, 0x1
.equ	ACCESSCTRL_SRAM2_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SRAM2_SP_MSB, 3
.equ	ACCESSCTRL_SRAM2_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM2_SU
# Description : If 1, and SP is also set, SRAM2 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SRAM2_SU_RESET, 0x1
.equ	ACCESSCTRL_SRAM2_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SRAM2_SU_MSB, 2
.equ	ACCESSCTRL_SRAM2_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM2_NSP
# Description : If 1, SRAM2 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SRAM2_NSP_RESET, 0x1
.equ	ACCESSCTRL_SRAM2_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SRAM2_NSP_MSB, 1
.equ	ACCESSCTRL_SRAM2_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM2_NSU
# Description : If 1, and NSP is also set, SRAM2 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SRAM2_NSU_RESET, 0x1
.equ	ACCESSCTRL_SRAM2_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SRAM2_NSU_MSB, 0
.equ	ACCESSCTRL_SRAM2_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SRAM3
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SRAM3, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SRAM3_OFFSET, 0x00000028
.equ	ACCESSCTRL_SRAM3_BITS, 0x000000ff
.equ	ACCESSCTRL_SRAM3_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM3_DBG
# Description : If 1, SRAM3 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SRAM3_DBG_RESET, 0x1
.equ	ACCESSCTRL_SRAM3_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SRAM3_DBG_MSB, 7
.equ	ACCESSCTRL_SRAM3_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM3_DMA
# Description : If 1, SRAM3 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM3_DMA_RESET, 0x1
.equ	ACCESSCTRL_SRAM3_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SRAM3_DMA_MSB, 6
.equ	ACCESSCTRL_SRAM3_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM3_CORE1
# Description : If 1, SRAM3 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM3_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SRAM3_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SRAM3_CORE1_MSB, 5
.equ	ACCESSCTRL_SRAM3_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM3_CORE0
# Description : If 1, SRAM3 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM3_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SRAM3_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SRAM3_CORE0_MSB, 4
.equ	ACCESSCTRL_SRAM3_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM3_SP
# Description : If 1, SRAM3 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SRAM3_SP_RESET, 0x1
.equ	ACCESSCTRL_SRAM3_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SRAM3_SP_MSB, 3
.equ	ACCESSCTRL_SRAM3_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM3_SU
# Description : If 1, and SP is also set, SRAM3 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SRAM3_SU_RESET, 0x1
.equ	ACCESSCTRL_SRAM3_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SRAM3_SU_MSB, 2
.equ	ACCESSCTRL_SRAM3_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM3_NSP
# Description : If 1, SRAM3 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SRAM3_NSP_RESET, 0x1
.equ	ACCESSCTRL_SRAM3_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SRAM3_NSP_MSB, 1
.equ	ACCESSCTRL_SRAM3_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM3_NSU
# Description : If 1, and NSP is also set, SRAM3 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SRAM3_NSU_RESET, 0x1
.equ	ACCESSCTRL_SRAM3_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SRAM3_NSU_MSB, 0
.equ	ACCESSCTRL_SRAM3_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SRAM4
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SRAM4, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SRAM4_OFFSET, 0x0000002c
.equ	ACCESSCTRL_SRAM4_BITS, 0x000000ff
.equ	ACCESSCTRL_SRAM4_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM4_DBG
# Description : If 1, SRAM4 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SRAM4_DBG_RESET, 0x1
.equ	ACCESSCTRL_SRAM4_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SRAM4_DBG_MSB, 7
.equ	ACCESSCTRL_SRAM4_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM4_DMA
# Description : If 1, SRAM4 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM4_DMA_RESET, 0x1
.equ	ACCESSCTRL_SRAM4_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SRAM4_DMA_MSB, 6
.equ	ACCESSCTRL_SRAM4_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM4_CORE1
# Description : If 1, SRAM4 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM4_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SRAM4_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SRAM4_CORE1_MSB, 5
.equ	ACCESSCTRL_SRAM4_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM4_CORE0
# Description : If 1, SRAM4 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM4_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SRAM4_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SRAM4_CORE0_MSB, 4
.equ	ACCESSCTRL_SRAM4_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM4_SP
# Description : If 1, SRAM4 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SRAM4_SP_RESET, 0x1
.equ	ACCESSCTRL_SRAM4_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SRAM4_SP_MSB, 3
.equ	ACCESSCTRL_SRAM4_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM4_SU
# Description : If 1, and SP is also set, SRAM4 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SRAM4_SU_RESET, 0x1
.equ	ACCESSCTRL_SRAM4_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SRAM4_SU_MSB, 2
.equ	ACCESSCTRL_SRAM4_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM4_NSP
# Description : If 1, SRAM4 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SRAM4_NSP_RESET, 0x1
.equ	ACCESSCTRL_SRAM4_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SRAM4_NSP_MSB, 1
.equ	ACCESSCTRL_SRAM4_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM4_NSU
# Description : If 1, and NSP is also set, SRAM4 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SRAM4_NSU_RESET, 0x1
.equ	ACCESSCTRL_SRAM4_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SRAM4_NSU_MSB, 0
.equ	ACCESSCTRL_SRAM4_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SRAM5
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SRAM5, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SRAM5_OFFSET, 0x00000030
.equ	ACCESSCTRL_SRAM5_BITS, 0x000000ff
.equ	ACCESSCTRL_SRAM5_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM5_DBG
# Description : If 1, SRAM5 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SRAM5_DBG_RESET, 0x1
.equ	ACCESSCTRL_SRAM5_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SRAM5_DBG_MSB, 7
.equ	ACCESSCTRL_SRAM5_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM5_DMA
# Description : If 1, SRAM5 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM5_DMA_RESET, 0x1
.equ	ACCESSCTRL_SRAM5_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SRAM5_DMA_MSB, 6
.equ	ACCESSCTRL_SRAM5_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM5_CORE1
# Description : If 1, SRAM5 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM5_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SRAM5_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SRAM5_CORE1_MSB, 5
.equ	ACCESSCTRL_SRAM5_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM5_CORE0
# Description : If 1, SRAM5 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM5_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SRAM5_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SRAM5_CORE0_MSB, 4
.equ	ACCESSCTRL_SRAM5_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM5_SP
# Description : If 1, SRAM5 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SRAM5_SP_RESET, 0x1
.equ	ACCESSCTRL_SRAM5_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SRAM5_SP_MSB, 3
.equ	ACCESSCTRL_SRAM5_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM5_SU
# Description : If 1, and SP is also set, SRAM5 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SRAM5_SU_RESET, 0x1
.equ	ACCESSCTRL_SRAM5_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SRAM5_SU_MSB, 2
.equ	ACCESSCTRL_SRAM5_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM5_NSP
# Description : If 1, SRAM5 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SRAM5_NSP_RESET, 0x1
.equ	ACCESSCTRL_SRAM5_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SRAM5_NSP_MSB, 1
.equ	ACCESSCTRL_SRAM5_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM5_NSU
# Description : If 1, and NSP is also set, SRAM5 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SRAM5_NSU_RESET, 0x1
.equ	ACCESSCTRL_SRAM5_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SRAM5_NSU_MSB, 0
.equ	ACCESSCTRL_SRAM5_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SRAM6
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SRAM6, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SRAM6_OFFSET, 0x00000034
.equ	ACCESSCTRL_SRAM6_BITS, 0x000000ff
.equ	ACCESSCTRL_SRAM6_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM6_DBG
# Description : If 1, SRAM6 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SRAM6_DBG_RESET, 0x1
.equ	ACCESSCTRL_SRAM6_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SRAM6_DBG_MSB, 7
.equ	ACCESSCTRL_SRAM6_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM6_DMA
# Description : If 1, SRAM6 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM6_DMA_RESET, 0x1
.equ	ACCESSCTRL_SRAM6_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SRAM6_DMA_MSB, 6
.equ	ACCESSCTRL_SRAM6_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM6_CORE1
# Description : If 1, SRAM6 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM6_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SRAM6_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SRAM6_CORE1_MSB, 5
.equ	ACCESSCTRL_SRAM6_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM6_CORE0
# Description : If 1, SRAM6 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM6_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SRAM6_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SRAM6_CORE0_MSB, 4
.equ	ACCESSCTRL_SRAM6_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM6_SP
# Description : If 1, SRAM6 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SRAM6_SP_RESET, 0x1
.equ	ACCESSCTRL_SRAM6_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SRAM6_SP_MSB, 3
.equ	ACCESSCTRL_SRAM6_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM6_SU
# Description : If 1, and SP is also set, SRAM6 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SRAM6_SU_RESET, 0x1
.equ	ACCESSCTRL_SRAM6_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SRAM6_SU_MSB, 2
.equ	ACCESSCTRL_SRAM6_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM6_NSP
# Description : If 1, SRAM6 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SRAM6_NSP_RESET, 0x1
.equ	ACCESSCTRL_SRAM6_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SRAM6_NSP_MSB, 1
.equ	ACCESSCTRL_SRAM6_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM6_NSU
# Description : If 1, and NSP is also set, SRAM6 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SRAM6_NSU_RESET, 0x1
.equ	ACCESSCTRL_SRAM6_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SRAM6_NSU_MSB, 0
.equ	ACCESSCTRL_SRAM6_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SRAM7
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SRAM7, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SRAM7_OFFSET, 0x00000038
.equ	ACCESSCTRL_SRAM7_BITS, 0x000000ff
.equ	ACCESSCTRL_SRAM7_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM7_DBG
# Description : If 1, SRAM7 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SRAM7_DBG_RESET, 0x1
.equ	ACCESSCTRL_SRAM7_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SRAM7_DBG_MSB, 7
.equ	ACCESSCTRL_SRAM7_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM7_DMA
# Description : If 1, SRAM7 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM7_DMA_RESET, 0x1
.equ	ACCESSCTRL_SRAM7_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SRAM7_DMA_MSB, 6
.equ	ACCESSCTRL_SRAM7_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM7_CORE1
# Description : If 1, SRAM7 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM7_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SRAM7_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SRAM7_CORE1_MSB, 5
.equ	ACCESSCTRL_SRAM7_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM7_CORE0
# Description : If 1, SRAM7 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM7_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SRAM7_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SRAM7_CORE0_MSB, 4
.equ	ACCESSCTRL_SRAM7_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM7_SP
# Description : If 1, SRAM7 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SRAM7_SP_RESET, 0x1
.equ	ACCESSCTRL_SRAM7_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SRAM7_SP_MSB, 3
.equ	ACCESSCTRL_SRAM7_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM7_SU
# Description : If 1, and SP is also set, SRAM7 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SRAM7_SU_RESET, 0x1
.equ	ACCESSCTRL_SRAM7_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SRAM7_SU_MSB, 2
.equ	ACCESSCTRL_SRAM7_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM7_NSP
# Description : If 1, SRAM7 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SRAM7_NSP_RESET, 0x1
.equ	ACCESSCTRL_SRAM7_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SRAM7_NSP_MSB, 1
.equ	ACCESSCTRL_SRAM7_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM7_NSU
# Description : If 1, and NSP is also set, SRAM7 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SRAM7_NSU_RESET, 0x1
.equ	ACCESSCTRL_SRAM7_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SRAM7_NSU_MSB, 0
.equ	ACCESSCTRL_SRAM7_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SRAM8
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SRAM8, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SRAM8_OFFSET, 0x0000003c
.equ	ACCESSCTRL_SRAM8_BITS, 0x000000ff
.equ	ACCESSCTRL_SRAM8_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM8_DBG
# Description : If 1, SRAM8 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SRAM8_DBG_RESET, 0x1
.equ	ACCESSCTRL_SRAM8_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SRAM8_DBG_MSB, 7
.equ	ACCESSCTRL_SRAM8_DBG_LSB, 7
# -----------------------------------------------------------------------------
