konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/accessctrl.inc
# Field       : ACCESSCTRL_SRAM8_DMA
# Description : If 1, SRAM8 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM8_DMA_RESET, 0x1
.equ	ACCESSCTRL_SRAM8_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SRAM8_DMA_MSB, 6
.equ	ACCESSCTRL_SRAM8_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM8_CORE1
# Description : If 1, SRAM8 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM8_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SRAM8_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SRAM8_CORE1_MSB, 5
.equ	ACCESSCTRL_SRAM8_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM8_CORE0
# Description : If 1, SRAM8 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM8_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SRAM8_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SRAM8_CORE0_MSB, 4
.equ	ACCESSCTRL_SRAM8_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM8_SP
# Description : If 1, SRAM8 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SRAM8_SP_RESET, 0x1
.equ	ACCESSCTRL_SRAM8_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SRAM8_SP_MSB, 3
.equ	ACCESSCTRL_SRAM8_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM8_SU
# Description : If 1, and SP is also set, SRAM8 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SRAM8_SU_RESET, 0x1
.equ	ACCESSCTRL_SRAM8_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SRAM8_SU_MSB, 2
.equ	ACCESSCTRL_SRAM8_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM8_NSP
# Description : If 1, SRAM8 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SRAM8_NSP_RESET, 0x1
.equ	ACCESSCTRL_SRAM8_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SRAM8_NSP_MSB, 1
.equ	ACCESSCTRL_SRAM8_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM8_NSU
# Description : If 1, and NSP is also set, SRAM8 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SRAM8_NSU_RESET, 0x1
.equ	ACCESSCTRL_SRAM8_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SRAM8_NSU_MSB, 0
.equ	ACCESSCTRL_SRAM8_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SRAM9
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SRAM9, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SRAM9_OFFSET, 0x00000040
.equ	ACCESSCTRL_SRAM9_BITS, 0x000000ff
.equ	ACCESSCTRL_SRAM9_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM9_DBG
# Description : If 1, SRAM9 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SRAM9_DBG_RESET, 0x1
.equ	ACCESSCTRL_SRAM9_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SRAM9_DBG_MSB, 7
.equ	ACCESSCTRL_SRAM9_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM9_DMA
# Description : If 1, SRAM9 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM9_DMA_RESET, 0x1
.equ	ACCESSCTRL_SRAM9_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SRAM9_DMA_MSB, 6
.equ	ACCESSCTRL_SRAM9_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM9_CORE1
# Description : If 1, SRAM9 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM9_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SRAM9_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SRAM9_CORE1_MSB, 5
.equ	ACCESSCTRL_SRAM9_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM9_CORE0
# Description : If 1, SRAM9 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SRAM9_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SRAM9_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SRAM9_CORE0_MSB, 4
.equ	ACCESSCTRL_SRAM9_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM9_SP
# Description : If 1, SRAM9 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SRAM9_SP_RESET, 0x1
.equ	ACCESSCTRL_SRAM9_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SRAM9_SP_MSB, 3
.equ	ACCESSCTRL_SRAM9_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM9_SU
# Description : If 1, and SP is also set, SRAM9 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SRAM9_SU_RESET, 0x1
.equ	ACCESSCTRL_SRAM9_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SRAM9_SU_MSB, 2
.equ	ACCESSCTRL_SRAM9_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM9_NSP
# Description : If 1, SRAM9 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SRAM9_NSP_RESET, 0x1
.equ	ACCESSCTRL_SRAM9_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SRAM9_NSP_MSB, 1
.equ	ACCESSCTRL_SRAM9_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SRAM9_NSU
# Description : If 1, and NSP is also set, SRAM9 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SRAM9_NSU_RESET, 0x1
.equ	ACCESSCTRL_SRAM9_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SRAM9_NSU_MSB, 0
.equ	ACCESSCTRL_SRAM9_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_DMA
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               DMA, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_DMA_OFFSET, 0x00000044
.equ	ACCESSCTRL_DMA_BITS, 0x000000ff
.equ	ACCESSCTRL_DMA_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_DMA_DBG
# Description : If 1, DMA can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_DMA_DBG_RESET, 0x1
.equ	ACCESSCTRL_DMA_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_DMA_DBG_MSB, 7
.equ	ACCESSCTRL_DMA_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_DMA_DMA
# Description : If 1, DMA can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_DMA_DMA_RESET, 0x1
.equ	ACCESSCTRL_DMA_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_DMA_DMA_MSB, 6
.equ	ACCESSCTRL_DMA_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_DMA_CORE1
# Description : If 1, DMA can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_DMA_CORE1_RESET, 0x1
.equ	ACCESSCTRL_DMA_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_DMA_CORE1_MSB, 5
.equ	ACCESSCTRL_DMA_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_DMA_CORE0
# Description : If 1, DMA can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_DMA_CORE0_RESET, 0x1
.equ	ACCESSCTRL_DMA_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_DMA_CORE0_MSB, 4
.equ	ACCESSCTRL_DMA_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_DMA_SP
# Description : If 1, DMA can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_DMA_SP_RESET, 0x1
.equ	ACCESSCTRL_DMA_SP_BITS, 0x00000008
.equ	ACCESSCTRL_DMA_SP_MSB, 3
.equ	ACCESSCTRL_DMA_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_DMA_SU
# Description : If 1, and SP is also set, DMA can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_DMA_SU_RESET, 0x1
.equ	ACCESSCTRL_DMA_SU_BITS, 0x00000004
.equ	ACCESSCTRL_DMA_SU_MSB, 2
.equ	ACCESSCTRL_DMA_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_DMA_NSP
# Description : If 1, DMA can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_DMA_NSP_RESET, 0x0
.equ	ACCESSCTRL_DMA_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_DMA_NSP_MSB, 1
.equ	ACCESSCTRL_DMA_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_DMA_NSU
# Description : If 1, and NSP is also set, DMA can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_DMA_NSU_RESET, 0x0
.equ	ACCESSCTRL_DMA_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_DMA_NSU_MSB, 0
.equ	ACCESSCTRL_DMA_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_USBCTRL
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               USBCTRL, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_USBCTRL_OFFSET, 0x00000048
.equ	ACCESSCTRL_USBCTRL_BITS, 0x000000ff
.equ	ACCESSCTRL_USBCTRL_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_USBCTRL_DBG
# Description : If 1, USBCTRL can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_USBCTRL_DBG_RESET, 0x1
.equ	ACCESSCTRL_USBCTRL_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_USBCTRL_DBG_MSB, 7
.equ	ACCESSCTRL_USBCTRL_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_USBCTRL_DMA
# Description : If 1, USBCTRL can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_USBCTRL_DMA_RESET, 0x1
.equ	ACCESSCTRL_USBCTRL_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_USBCTRL_DMA_MSB, 6
.equ	ACCESSCTRL_USBCTRL_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_USBCTRL_CORE1
# Description : If 1, USBCTRL can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_USBCTRL_CORE1_RESET, 0x1
.equ	ACCESSCTRL_USBCTRL_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_USBCTRL_CORE1_MSB, 5
.equ	ACCESSCTRL_USBCTRL_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_USBCTRL_CORE0
# Description : If 1, USBCTRL can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_USBCTRL_CORE0_RESET, 0x1
.equ	ACCESSCTRL_USBCTRL_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_USBCTRL_CORE0_MSB, 4
.equ	ACCESSCTRL_USBCTRL_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_USBCTRL_SP
# Description : If 1, USBCTRL can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_USBCTRL_SP_RESET, 0x1
.equ	ACCESSCTRL_USBCTRL_SP_BITS, 0x00000008
.equ	ACCESSCTRL_USBCTRL_SP_MSB, 3
.equ	ACCESSCTRL_USBCTRL_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_USBCTRL_SU
# Description : If 1, and SP is also set, USBCTRL can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_USBCTRL_SU_RESET, 0x1
.equ	ACCESSCTRL_USBCTRL_SU_BITS, 0x00000004
.equ	ACCESSCTRL_USBCTRL_SU_MSB, 2
.equ	ACCESSCTRL_USBCTRL_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_USBCTRL_NSP
# Description : If 1, USBCTRL can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_USBCTRL_NSP_RESET, 0x0
.equ	ACCESSCTRL_USBCTRL_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_USBCTRL_NSP_MSB, 1
.equ	ACCESSCTRL_USBCTRL_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_USBCTRL_NSU
# Description : If 1, and NSP is also set, USBCTRL can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_USBCTRL_NSU_RESET, 0x0
.equ	ACCESSCTRL_USBCTRL_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_USBCTRL_NSU_MSB, 0
.equ	ACCESSCTRL_USBCTRL_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_PIO0
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               PIO0, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_PIO0_OFFSET, 0x0000004c
.equ	ACCESSCTRL_PIO0_BITS, 0x000000ff
.equ	ACCESSCTRL_PIO0_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO0_DBG
# Description : If 1, PIO0 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PIO0_DBG_RESET, 0x1
.equ	ACCESSCTRL_PIO0_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_PIO0_DBG_MSB, 7
.equ	ACCESSCTRL_PIO0_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO0_DMA
# Description : If 1, PIO0 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PIO0_DMA_RESET, 0x1
.equ	ACCESSCTRL_PIO0_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_PIO0_DMA_MSB, 6
.equ	ACCESSCTRL_PIO0_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO0_CORE1
# Description : If 1, PIO0 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PIO0_CORE1_RESET, 0x1
.equ	ACCESSCTRL_PIO0_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_PIO0_CORE1_MSB, 5
.equ	ACCESSCTRL_PIO0_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO0_CORE0
# Description : If 1, PIO0 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PIO0_CORE0_RESET, 0x1
.equ	ACCESSCTRL_PIO0_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_PIO0_CORE0_MSB, 4
.equ	ACCESSCTRL_PIO0_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO0_SP
# Description : If 1, PIO0 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_PIO0_SP_RESET, 0x1
.equ	ACCESSCTRL_PIO0_SP_BITS, 0x00000008
.equ	ACCESSCTRL_PIO0_SP_MSB, 3
.equ	ACCESSCTRL_PIO0_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO0_SU
# Description : If 1, and SP is also set, PIO0 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_PIO0_SU_RESET, 0x1
.equ	ACCESSCTRL_PIO0_SU_BITS, 0x00000004
.equ	ACCESSCTRL_PIO0_SU_MSB, 2
.equ	ACCESSCTRL_PIO0_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO0_NSP
# Description : If 1, PIO0 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_PIO0_NSP_RESET, 0x0
.equ	ACCESSCTRL_PIO0_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_PIO0_NSP_MSB, 1
.equ	ACCESSCTRL_PIO0_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO0_NSU
# Description : If 1, and NSP is also set, PIO0 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_PIO0_NSU_RESET, 0x0
.equ	ACCESSCTRL_PIO0_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_PIO0_NSU_MSB, 0
.equ	ACCESSCTRL_PIO0_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_PIO1
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               PIO1, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_PIO1_OFFSET, 0x00000050
.equ	ACCESSCTRL_PIO1_BITS, 0x000000ff
.equ	ACCESSCTRL_PIO1_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO1_DBG
# Description : If 1, PIO1 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PIO1_DBG_RESET, 0x1
.equ	ACCESSCTRL_PIO1_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_PIO1_DBG_MSB, 7
.equ	ACCESSCTRL_PIO1_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO1_DMA
# Description : If 1, PIO1 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PIO1_DMA_RESET, 0x1
.equ	ACCESSCTRL_PIO1_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_PIO1_DMA_MSB, 6
.equ	ACCESSCTRL_PIO1_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO1_CORE1
# Description : If 1, PIO1 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PIO1_CORE1_RESET, 0x1
.equ	ACCESSCTRL_PIO1_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_PIO1_CORE1_MSB, 5
.equ	ACCESSCTRL_PIO1_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO1_CORE0
# Description : If 1, PIO1 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PIO1_CORE0_RESET, 0x1
.equ	ACCESSCTRL_PIO1_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_PIO1_CORE0_MSB, 4
.equ	ACCESSCTRL_PIO1_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO1_SP
# Description : If 1, PIO1 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_PIO1_SP_RESET, 0x1
.equ	ACCESSCTRL_PIO1_SP_BITS, 0x00000008
.equ	ACCESSCTRL_PIO1_SP_MSB, 3
.equ	ACCESSCTRL_PIO1_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO1_SU
# Description : If 1, and SP is also set, PIO1 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_PIO1_SU_RESET, 0x1
.equ	ACCESSCTRL_PIO1_SU_BITS, 0x00000004
.equ	ACCESSCTRL_PIO1_SU_MSB, 2
.equ	ACCESSCTRL_PIO1_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO1_NSP
# Description : If 1, PIO1 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_PIO1_NSP_RESET, 0x0
.equ	ACCESSCTRL_PIO1_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_PIO1_NSP_MSB, 1
.equ	ACCESSCTRL_PIO1_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO1_NSU
# Description : If 1, and NSP is also set, PIO1 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_PIO1_NSU_RESET, 0x0
.equ	ACCESSCTRL_PIO1_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_PIO1_NSU_MSB, 0
.equ	ACCESSCTRL_PIO1_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_PIO2
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               PIO2, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_PIO2_OFFSET, 0x00000054
.equ	ACCESSCTRL_PIO2_BITS, 0x000000ff
.equ	ACCESSCTRL_PIO2_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO2_DBG
# Description : If 1, PIO2 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PIO2_DBG_RESET, 0x1
.equ	ACCESSCTRL_PIO2_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_PIO2_DBG_MSB, 7
.equ	ACCESSCTRL_PIO2_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO2_DMA
# Description : If 1, PIO2 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PIO2_DMA_RESET, 0x1
.equ	ACCESSCTRL_PIO2_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_PIO2_DMA_MSB, 6
.equ	ACCESSCTRL_PIO2_DMA_LSB, 6
# -----------------------------------------------------------------------------
