konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/accessctrl.inc
# Field       : ACCESSCTRL_PIO2_CORE1
# Description : If 1, PIO2 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PIO2_CORE1_RESET, 0x1
.equ	ACCESSCTRL_PIO2_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_PIO2_CORE1_MSB, 5
.equ	ACCESSCTRL_PIO2_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO2_CORE0
# Description : If 1, PIO2 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PIO2_CORE0_RESET, 0x1
.equ	ACCESSCTRL_PIO2_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_PIO2_CORE0_MSB, 4
.equ	ACCESSCTRL_PIO2_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO2_SP
# Description : If 1, PIO2 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_PIO2_SP_RESET, 0x1
.equ	ACCESSCTRL_PIO2_SP_BITS, 0x00000008
.equ	ACCESSCTRL_PIO2_SP_MSB, 3
.equ	ACCESSCTRL_PIO2_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO2_SU
# Description : If 1, and SP is also set, PIO2 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_PIO2_SU_RESET, 0x1
.equ	ACCESSCTRL_PIO2_SU_BITS, 0x00000004
.equ	ACCESSCTRL_PIO2_SU_MSB, 2
.equ	ACCESSCTRL_PIO2_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO2_NSP
# Description : If 1, PIO2 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_PIO2_NSP_RESET, 0x0
.equ	ACCESSCTRL_PIO2_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_PIO2_NSP_MSB, 1
.equ	ACCESSCTRL_PIO2_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PIO2_NSU
# Description : If 1, and NSP is also set, PIO2 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_PIO2_NSU_RESET, 0x0
.equ	ACCESSCTRL_PIO2_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_PIO2_NSU_MSB, 0
.equ	ACCESSCTRL_PIO2_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_CORESIGHT_TRACE
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               CORESIGHT_TRACE, and at what security/privilege levels they can
#               do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_CORESIGHT_TRACE_OFFSET, 0x00000058
.equ	ACCESSCTRL_CORESIGHT_TRACE_BITS, 0x000000ff
.equ	ACCESSCTRL_CORESIGHT_TRACE_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_TRACE_DBG
# Description : If 1, CORESIGHT_TRACE can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_CORESIGHT_TRACE_DBG_RESET, 0x1
.equ	ACCESSCTRL_CORESIGHT_TRACE_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_CORESIGHT_TRACE_DBG_MSB, 7
.equ	ACCESSCTRL_CORESIGHT_TRACE_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_TRACE_DMA
# Description : If 1, CORESIGHT_TRACE can be accessed by the DMA, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_CORESIGHT_TRACE_DMA_RESET, 0x0
.equ	ACCESSCTRL_CORESIGHT_TRACE_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_CORESIGHT_TRACE_DMA_MSB, 6
.equ	ACCESSCTRL_CORESIGHT_TRACE_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_TRACE_CORE1
# Description : If 1, CORESIGHT_TRACE can be accessed by core 1, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_CORESIGHT_TRACE_CORE1_RESET, 0x1
.equ	ACCESSCTRL_CORESIGHT_TRACE_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_CORESIGHT_TRACE_CORE1_MSB, 5
.equ	ACCESSCTRL_CORESIGHT_TRACE_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_TRACE_CORE0
# Description : If 1, CORESIGHT_TRACE can be accessed by core 0, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_CORESIGHT_TRACE_CORE0_RESET, 0x1
.equ	ACCESSCTRL_CORESIGHT_TRACE_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_CORESIGHT_TRACE_CORE0_MSB, 4
.equ	ACCESSCTRL_CORESIGHT_TRACE_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_TRACE_SP
# Description : If 1, CORESIGHT_TRACE can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_CORESIGHT_TRACE_SP_RESET, 0x1
.equ	ACCESSCTRL_CORESIGHT_TRACE_SP_BITS, 0x00000008
.equ	ACCESSCTRL_CORESIGHT_TRACE_SP_MSB, 3
.equ	ACCESSCTRL_CORESIGHT_TRACE_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_TRACE_SU
# Description : If 1, and SP is also set, CORESIGHT_TRACE can be accessed from
#               a Secure, Unprivileged context.
.equ	ACCESSCTRL_CORESIGHT_TRACE_SU_RESET, 0x0
.equ	ACCESSCTRL_CORESIGHT_TRACE_SU_BITS, 0x00000004
.equ	ACCESSCTRL_CORESIGHT_TRACE_SU_MSB, 2
.equ	ACCESSCTRL_CORESIGHT_TRACE_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_TRACE_NSP
# Description : If 1, CORESIGHT_TRACE can be accessed from a Non-secure,
#               Privileged context.
.equ	ACCESSCTRL_CORESIGHT_TRACE_NSP_RESET, 0x0
.equ	ACCESSCTRL_CORESIGHT_TRACE_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_CORESIGHT_TRACE_NSP_MSB, 1
.equ	ACCESSCTRL_CORESIGHT_TRACE_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_TRACE_NSU
# Description : If 1, and NSP is also set, CORESIGHT_TRACE can be accessed from
#               a Non-secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_CORESIGHT_TRACE_NSU_RESET, 0x0
.equ	ACCESSCTRL_CORESIGHT_TRACE_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_CORESIGHT_TRACE_NSU_MSB, 0
.equ	ACCESSCTRL_CORESIGHT_TRACE_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_CORESIGHT_PERIPH
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               CORESIGHT_PERIPH, and at what security/privilege levels they
#               can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_CORESIGHT_PERIPH_OFFSET, 0x0000005c
.equ	ACCESSCTRL_CORESIGHT_PERIPH_BITS, 0x000000ff
.equ	ACCESSCTRL_CORESIGHT_PERIPH_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_PERIPH_DBG
# Description : If 1, CORESIGHT_PERIPH can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_CORESIGHT_PERIPH_DBG_RESET, 0x1
.equ	ACCESSCTRL_CORESIGHT_PERIPH_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_CORESIGHT_PERIPH_DBG_MSB, 7
.equ	ACCESSCTRL_CORESIGHT_PERIPH_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_PERIPH_DMA
# Description : If 1, CORESIGHT_PERIPH can be accessed by the DMA, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_CORESIGHT_PERIPH_DMA_RESET, 0x0
.equ	ACCESSCTRL_CORESIGHT_PERIPH_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_CORESIGHT_PERIPH_DMA_MSB, 6
.equ	ACCESSCTRL_CORESIGHT_PERIPH_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_PERIPH_CORE1
# Description : If 1, CORESIGHT_PERIPH can be accessed by core 1, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_CORESIGHT_PERIPH_CORE1_RESET, 0x1
.equ	ACCESSCTRL_CORESIGHT_PERIPH_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_CORESIGHT_PERIPH_CORE1_MSB, 5
.equ	ACCESSCTRL_CORESIGHT_PERIPH_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_PERIPH_CORE0
# Description : If 1, CORESIGHT_PERIPH can be accessed by core 0, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_CORESIGHT_PERIPH_CORE0_RESET, 0x1
.equ	ACCESSCTRL_CORESIGHT_PERIPH_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_CORESIGHT_PERIPH_CORE0_MSB, 4
.equ	ACCESSCTRL_CORESIGHT_PERIPH_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_PERIPH_SP
# Description : If 1, CORESIGHT_PERIPH can be accessed from a Secure,
#               Privileged context.
.equ	ACCESSCTRL_CORESIGHT_PERIPH_SP_RESET, 0x1
.equ	ACCESSCTRL_CORESIGHT_PERIPH_SP_BITS, 0x00000008
.equ	ACCESSCTRL_CORESIGHT_PERIPH_SP_MSB, 3
.equ	ACCESSCTRL_CORESIGHT_PERIPH_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_PERIPH_SU
# Description : If 1, and SP is also set, CORESIGHT_PERIPH can be accessed from
#               a Secure, Unprivileged context.
.equ	ACCESSCTRL_CORESIGHT_PERIPH_SU_RESET, 0x0
.equ	ACCESSCTRL_CORESIGHT_PERIPH_SU_BITS, 0x00000004
.equ	ACCESSCTRL_CORESIGHT_PERIPH_SU_MSB, 2
.equ	ACCESSCTRL_CORESIGHT_PERIPH_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_PERIPH_NSP
# Description : If 1, CORESIGHT_PERIPH can be accessed from a Non-secure,
#               Privileged context.
.equ	ACCESSCTRL_CORESIGHT_PERIPH_NSP_RESET, 0x0
.equ	ACCESSCTRL_CORESIGHT_PERIPH_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_CORESIGHT_PERIPH_NSP_MSB, 1
.equ	ACCESSCTRL_CORESIGHT_PERIPH_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CORESIGHT_PERIPH_NSU
# Description : If 1, and NSP is also set, CORESIGHT_PERIPH can be accessed
#               from a Non-secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_CORESIGHT_PERIPH_NSU_RESET, 0x0
.equ	ACCESSCTRL_CORESIGHT_PERIPH_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_CORESIGHT_PERIPH_NSU_MSB, 0
.equ	ACCESSCTRL_CORESIGHT_PERIPH_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SYSINFO
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SYSINFO, and at what security/privilege levels they can do so.
#
#               Defaults to fully open access.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SYSINFO_OFFSET, 0x00000060
.equ	ACCESSCTRL_SYSINFO_BITS, 0x000000ff
.equ	ACCESSCTRL_SYSINFO_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSINFO_DBG
# Description : If 1, SYSINFO can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SYSINFO_DBG_RESET, 0x1
.equ	ACCESSCTRL_SYSINFO_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SYSINFO_DBG_MSB, 7
.equ	ACCESSCTRL_SYSINFO_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSINFO_DMA
# Description : If 1, SYSINFO can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SYSINFO_DMA_RESET, 0x1
.equ	ACCESSCTRL_SYSINFO_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SYSINFO_DMA_MSB, 6
.equ	ACCESSCTRL_SYSINFO_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSINFO_CORE1
# Description : If 1, SYSINFO can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SYSINFO_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SYSINFO_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SYSINFO_CORE1_MSB, 5
.equ	ACCESSCTRL_SYSINFO_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSINFO_CORE0
# Description : If 1, SYSINFO can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SYSINFO_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SYSINFO_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SYSINFO_CORE0_MSB, 4
.equ	ACCESSCTRL_SYSINFO_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSINFO_SP
# Description : If 1, SYSINFO can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_SYSINFO_SP_RESET, 0x1
.equ	ACCESSCTRL_SYSINFO_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SYSINFO_SP_MSB, 3
.equ	ACCESSCTRL_SYSINFO_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSINFO_SU
# Description : If 1, and SP is also set, SYSINFO can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_SYSINFO_SU_RESET, 0x1
.equ	ACCESSCTRL_SYSINFO_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SYSINFO_SU_MSB, 2
.equ	ACCESSCTRL_SYSINFO_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSINFO_NSP
# Description : If 1, SYSINFO can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SYSINFO_NSP_RESET, 0x1
.equ	ACCESSCTRL_SYSINFO_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SYSINFO_NSP_MSB, 1
.equ	ACCESSCTRL_SYSINFO_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSINFO_NSU
# Description : If 1, and NSP is also set, SYSINFO can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SYSINFO_NSU_RESET, 0x1
.equ	ACCESSCTRL_SYSINFO_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SYSINFO_NSU_MSB, 0
.equ	ACCESSCTRL_SYSINFO_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_RESETS
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               RESETS, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_RESETS_OFFSET, 0x00000064
.equ	ACCESSCTRL_RESETS_BITS, 0x000000ff
.equ	ACCESSCTRL_RESETS_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RESETS_DBG
# Description : If 1, RESETS can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_RESETS_DBG_RESET, 0x1
.equ	ACCESSCTRL_RESETS_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_RESETS_DBG_MSB, 7
.equ	ACCESSCTRL_RESETS_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RESETS_DMA
# Description : If 1, RESETS can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_RESETS_DMA_RESET, 0x1
.equ	ACCESSCTRL_RESETS_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_RESETS_DMA_MSB, 6
.equ	ACCESSCTRL_RESETS_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RESETS_CORE1
# Description : If 1, RESETS can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_RESETS_CORE1_RESET, 0x1
.equ	ACCESSCTRL_RESETS_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_RESETS_CORE1_MSB, 5
.equ	ACCESSCTRL_RESETS_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RESETS_CORE0
# Description : If 1, RESETS can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_RESETS_CORE0_RESET, 0x1
.equ	ACCESSCTRL_RESETS_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_RESETS_CORE0_MSB, 4
.equ	ACCESSCTRL_RESETS_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RESETS_SP
# Description : If 1, RESETS can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_RESETS_SP_RESET, 0x1
.equ	ACCESSCTRL_RESETS_SP_BITS, 0x00000008
.equ	ACCESSCTRL_RESETS_SP_MSB, 3
.equ	ACCESSCTRL_RESETS_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RESETS_SU
# Description : If 1, and SP is also set, RESETS can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_RESETS_SU_RESET, 0x1
.equ	ACCESSCTRL_RESETS_SU_BITS, 0x00000004
.equ	ACCESSCTRL_RESETS_SU_MSB, 2
.equ	ACCESSCTRL_RESETS_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RESETS_NSP
# Description : If 1, RESETS can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_RESETS_NSP_RESET, 0x0
.equ	ACCESSCTRL_RESETS_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_RESETS_NSP_MSB, 1
.equ	ACCESSCTRL_RESETS_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RESETS_NSU
# Description : If 1, and NSP is also set, RESETS can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_RESETS_NSU_RESET, 0x0
.equ	ACCESSCTRL_RESETS_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_RESETS_NSU_MSB, 0
.equ	ACCESSCTRL_RESETS_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_IO_BANK0
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               IO_BANK0, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_IO_BANK0_OFFSET, 0x00000068
.equ	ACCESSCTRL_IO_BANK0_BITS, 0x000000ff
.equ	ACCESSCTRL_IO_BANK0_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK0_DBG
# Description : If 1, IO_BANK0 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_IO_BANK0_DBG_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK0_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_IO_BANK0_DBG_MSB, 7
.equ	ACCESSCTRL_IO_BANK0_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK0_DMA
# Description : If 1, IO_BANK0 can be accessed by the DMA, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_IO_BANK0_DMA_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK0_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_IO_BANK0_DMA_MSB, 6
.equ	ACCESSCTRL_IO_BANK0_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK0_CORE1
# Description : If 1, IO_BANK0 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_IO_BANK0_CORE1_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK0_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_IO_BANK0_CORE1_MSB, 5
.equ	ACCESSCTRL_IO_BANK0_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK0_CORE0
# Description : If 1, IO_BANK0 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_IO_BANK0_CORE0_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK0_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_IO_BANK0_CORE0_MSB, 4
.equ	ACCESSCTRL_IO_BANK0_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK0_SP
# Description : If 1, IO_BANK0 can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_IO_BANK0_SP_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK0_SP_BITS, 0x00000008
.equ	ACCESSCTRL_IO_BANK0_SP_MSB, 3
.equ	ACCESSCTRL_IO_BANK0_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK0_SU
# Description : If 1, and SP is also set, IO_BANK0 can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_IO_BANK0_SU_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK0_SU_BITS, 0x00000004
.equ	ACCESSCTRL_IO_BANK0_SU_MSB, 2
.equ	ACCESSCTRL_IO_BANK0_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK0_NSP
# Description : If 1, IO_BANK0 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_IO_BANK0_NSP_RESET, 0x0
.equ	ACCESSCTRL_IO_BANK0_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_IO_BANK0_NSP_MSB, 1
.equ	ACCESSCTRL_IO_BANK0_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK0_NSU
# Description : If 1, and NSP is also set, IO_BANK0 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_IO_BANK0_NSU_RESET, 0x0
.equ	ACCESSCTRL_IO_BANK0_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_IO_BANK0_NSU_MSB, 0
.equ	ACCESSCTRL_IO_BANK0_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_IO_BANK1
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               IO_BANK1, and at what security/privilege levels they can do so.
#
