konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/accessctrl.inc
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_IO_BANK1_OFFSET, 0x0000006c
.equ	ACCESSCTRL_IO_BANK1_BITS, 0x000000ff
.equ	ACCESSCTRL_IO_BANK1_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK1_DBG
# Description : If 1, IO_BANK1 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_IO_BANK1_DBG_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK1_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_IO_BANK1_DBG_MSB, 7
.equ	ACCESSCTRL_IO_BANK1_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK1_DMA
# Description : If 1, IO_BANK1 can be accessed by the DMA, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_IO_BANK1_DMA_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK1_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_IO_BANK1_DMA_MSB, 6
.equ	ACCESSCTRL_IO_BANK1_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK1_CORE1
# Description : If 1, IO_BANK1 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_IO_BANK1_CORE1_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK1_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_IO_BANK1_CORE1_MSB, 5
.equ	ACCESSCTRL_IO_BANK1_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK1_CORE0
# Description : If 1, IO_BANK1 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_IO_BANK1_CORE0_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK1_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_IO_BANK1_CORE0_MSB, 4
.equ	ACCESSCTRL_IO_BANK1_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK1_SP
# Description : If 1, IO_BANK1 can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_IO_BANK1_SP_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK1_SP_BITS, 0x00000008
.equ	ACCESSCTRL_IO_BANK1_SP_MSB, 3
.equ	ACCESSCTRL_IO_BANK1_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK1_SU
# Description : If 1, and SP is also set, IO_BANK1 can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_IO_BANK1_SU_RESET, 0x1
.equ	ACCESSCTRL_IO_BANK1_SU_BITS, 0x00000004
.equ	ACCESSCTRL_IO_BANK1_SU_MSB, 2
.equ	ACCESSCTRL_IO_BANK1_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK1_NSP
# Description : If 1, IO_BANK1 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_IO_BANK1_NSP_RESET, 0x0
.equ	ACCESSCTRL_IO_BANK1_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_IO_BANK1_NSP_MSB, 1
.equ	ACCESSCTRL_IO_BANK1_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_IO_BANK1_NSU
# Description : If 1, and NSP is also set, IO_BANK1 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_IO_BANK1_NSU_RESET, 0x0
.equ	ACCESSCTRL_IO_BANK1_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_IO_BANK1_NSU_MSB, 0
.equ	ACCESSCTRL_IO_BANK1_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_PADS_BANK0
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               PADS_BANK0, and at what security/privilege levels they can do
#               so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_PADS_BANK0_OFFSET, 0x00000070
.equ	ACCESSCTRL_PADS_BANK0_BITS, 0x000000ff
.equ	ACCESSCTRL_PADS_BANK0_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_BANK0_DBG
# Description : If 1, PADS_BANK0 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PADS_BANK0_DBG_RESET, 0x1
.equ	ACCESSCTRL_PADS_BANK0_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_PADS_BANK0_DBG_MSB, 7
.equ	ACCESSCTRL_PADS_BANK0_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_BANK0_DMA
# Description : If 1, PADS_BANK0 can be accessed by the DMA, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PADS_BANK0_DMA_RESET, 0x1
.equ	ACCESSCTRL_PADS_BANK0_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_PADS_BANK0_DMA_MSB, 6
.equ	ACCESSCTRL_PADS_BANK0_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_BANK0_CORE1
# Description : If 1, PADS_BANK0 can be accessed by core 1, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PADS_BANK0_CORE1_RESET, 0x1
.equ	ACCESSCTRL_PADS_BANK0_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_PADS_BANK0_CORE1_MSB, 5
.equ	ACCESSCTRL_PADS_BANK0_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_BANK0_CORE0
# Description : If 1, PADS_BANK0 can be accessed by core 0, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PADS_BANK0_CORE0_RESET, 0x1
.equ	ACCESSCTRL_PADS_BANK0_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_PADS_BANK0_CORE0_MSB, 4
.equ	ACCESSCTRL_PADS_BANK0_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_BANK0_SP
# Description : If 1, PADS_BANK0 can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_PADS_BANK0_SP_RESET, 0x1
.equ	ACCESSCTRL_PADS_BANK0_SP_BITS, 0x00000008
.equ	ACCESSCTRL_PADS_BANK0_SP_MSB, 3
.equ	ACCESSCTRL_PADS_BANK0_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_BANK0_SU
# Description : If 1, and SP is also set, PADS_BANK0 can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_PADS_BANK0_SU_RESET, 0x1
.equ	ACCESSCTRL_PADS_BANK0_SU_BITS, 0x00000004
.equ	ACCESSCTRL_PADS_BANK0_SU_MSB, 2
.equ	ACCESSCTRL_PADS_BANK0_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_BANK0_NSP
# Description : If 1, PADS_BANK0 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_PADS_BANK0_NSP_RESET, 0x0
.equ	ACCESSCTRL_PADS_BANK0_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_PADS_BANK0_NSP_MSB, 1
.equ	ACCESSCTRL_PADS_BANK0_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_BANK0_NSU
# Description : If 1, and NSP is also set, PADS_BANK0 can be accessed from a
#               Non-secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_PADS_BANK0_NSU_RESET, 0x0
.equ	ACCESSCTRL_PADS_BANK0_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_PADS_BANK0_NSU_MSB, 0
.equ	ACCESSCTRL_PADS_BANK0_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_PADS_QSPI
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               PADS_QSPI, and at what security/privilege levels they can do
#               so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_PADS_QSPI_OFFSET, 0x00000074
.equ	ACCESSCTRL_PADS_QSPI_BITS, 0x000000ff
.equ	ACCESSCTRL_PADS_QSPI_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_QSPI_DBG
# Description : If 1, PADS_QSPI can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PADS_QSPI_DBG_RESET, 0x1
.equ	ACCESSCTRL_PADS_QSPI_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_PADS_QSPI_DBG_MSB, 7
.equ	ACCESSCTRL_PADS_QSPI_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_QSPI_DMA
# Description : If 1, PADS_QSPI can be accessed by the DMA, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PADS_QSPI_DMA_RESET, 0x1
.equ	ACCESSCTRL_PADS_QSPI_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_PADS_QSPI_DMA_MSB, 6
.equ	ACCESSCTRL_PADS_QSPI_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_QSPI_CORE1
# Description : If 1, PADS_QSPI can be accessed by core 1, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PADS_QSPI_CORE1_RESET, 0x1
.equ	ACCESSCTRL_PADS_QSPI_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_PADS_QSPI_CORE1_MSB, 5
.equ	ACCESSCTRL_PADS_QSPI_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_QSPI_CORE0
# Description : If 1, PADS_QSPI can be accessed by core 0, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PADS_QSPI_CORE0_RESET, 0x1
.equ	ACCESSCTRL_PADS_QSPI_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_PADS_QSPI_CORE0_MSB, 4
.equ	ACCESSCTRL_PADS_QSPI_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_QSPI_SP
# Description : If 1, PADS_QSPI can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_PADS_QSPI_SP_RESET, 0x1
.equ	ACCESSCTRL_PADS_QSPI_SP_BITS, 0x00000008
.equ	ACCESSCTRL_PADS_QSPI_SP_MSB, 3
.equ	ACCESSCTRL_PADS_QSPI_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_QSPI_SU
# Description : If 1, and SP is also set, PADS_QSPI can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_PADS_QSPI_SU_RESET, 0x1
.equ	ACCESSCTRL_PADS_QSPI_SU_BITS, 0x00000004
.equ	ACCESSCTRL_PADS_QSPI_SU_MSB, 2
.equ	ACCESSCTRL_PADS_QSPI_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_QSPI_NSP
# Description : If 1, PADS_QSPI can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_PADS_QSPI_NSP_RESET, 0x0
.equ	ACCESSCTRL_PADS_QSPI_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_PADS_QSPI_NSP_MSB, 1
.equ	ACCESSCTRL_PADS_QSPI_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PADS_QSPI_NSU
# Description : If 1, and NSP is also set, PADS_QSPI can be accessed from a
#               Non-secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_PADS_QSPI_NSU_RESET, 0x0
.equ	ACCESSCTRL_PADS_QSPI_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_PADS_QSPI_NSU_MSB, 0
.equ	ACCESSCTRL_PADS_QSPI_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_BUSCTRL
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               BUSCTRL, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_BUSCTRL_OFFSET, 0x00000078
.equ	ACCESSCTRL_BUSCTRL_BITS, 0x000000ff
.equ	ACCESSCTRL_BUSCTRL_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_BUSCTRL_DBG
# Description : If 1, BUSCTRL can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_BUSCTRL_DBG_RESET, 0x1
.equ	ACCESSCTRL_BUSCTRL_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_BUSCTRL_DBG_MSB, 7
.equ	ACCESSCTRL_BUSCTRL_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_BUSCTRL_DMA
# Description : If 1, BUSCTRL can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_BUSCTRL_DMA_RESET, 0x1
.equ	ACCESSCTRL_BUSCTRL_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_BUSCTRL_DMA_MSB, 6
.equ	ACCESSCTRL_BUSCTRL_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_BUSCTRL_CORE1
# Description : If 1, BUSCTRL can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_BUSCTRL_CORE1_RESET, 0x1
.equ	ACCESSCTRL_BUSCTRL_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_BUSCTRL_CORE1_MSB, 5
.equ	ACCESSCTRL_BUSCTRL_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_BUSCTRL_CORE0
# Description : If 1, BUSCTRL can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_BUSCTRL_CORE0_RESET, 0x1
.equ	ACCESSCTRL_BUSCTRL_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_BUSCTRL_CORE0_MSB, 4
.equ	ACCESSCTRL_BUSCTRL_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_BUSCTRL_SP
# Description : If 1, BUSCTRL can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_BUSCTRL_SP_RESET, 0x1
.equ	ACCESSCTRL_BUSCTRL_SP_BITS, 0x00000008
.equ	ACCESSCTRL_BUSCTRL_SP_MSB, 3
.equ	ACCESSCTRL_BUSCTRL_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_BUSCTRL_SU
# Description : If 1, and SP is also set, BUSCTRL can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_BUSCTRL_SU_RESET, 0x1
.equ	ACCESSCTRL_BUSCTRL_SU_BITS, 0x00000004
.equ	ACCESSCTRL_BUSCTRL_SU_MSB, 2
.equ	ACCESSCTRL_BUSCTRL_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_BUSCTRL_NSP
# Description : If 1, BUSCTRL can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_BUSCTRL_NSP_RESET, 0x0
.equ	ACCESSCTRL_BUSCTRL_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_BUSCTRL_NSP_MSB, 1
.equ	ACCESSCTRL_BUSCTRL_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_BUSCTRL_NSU
# Description : If 1, and NSP is also set, BUSCTRL can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_BUSCTRL_NSU_RESET, 0x0
.equ	ACCESSCTRL_BUSCTRL_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_BUSCTRL_NSU_MSB, 0
.equ	ACCESSCTRL_BUSCTRL_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_ADC0
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               ADC0, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_ADC0_OFFSET, 0x0000007c
.equ	ACCESSCTRL_ADC0_BITS, 0x000000ff
.equ	ACCESSCTRL_ADC0_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ADC0_DBG
# Description : If 1, ADC0 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_ADC0_DBG_RESET, 0x1
.equ	ACCESSCTRL_ADC0_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_ADC0_DBG_MSB, 7
.equ	ACCESSCTRL_ADC0_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ADC0_DMA
# Description : If 1, ADC0 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_ADC0_DMA_RESET, 0x1
.equ	ACCESSCTRL_ADC0_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_ADC0_DMA_MSB, 6
.equ	ACCESSCTRL_ADC0_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ADC0_CORE1
# Description : If 1, ADC0 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_ADC0_CORE1_RESET, 0x1
.equ	ACCESSCTRL_ADC0_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_ADC0_CORE1_MSB, 5
.equ	ACCESSCTRL_ADC0_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ADC0_CORE0
# Description : If 1, ADC0 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_ADC0_CORE0_RESET, 0x1
.equ	ACCESSCTRL_ADC0_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_ADC0_CORE0_MSB, 4
.equ	ACCESSCTRL_ADC0_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ADC0_SP
# Description : If 1, ADC0 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_ADC0_SP_RESET, 0x1
.equ	ACCESSCTRL_ADC0_SP_BITS, 0x00000008
.equ	ACCESSCTRL_ADC0_SP_MSB, 3
.equ	ACCESSCTRL_ADC0_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ADC0_SU
# Description : If 1, and SP is also set, ADC0 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_ADC0_SU_RESET, 0x1
.equ	ACCESSCTRL_ADC0_SU_BITS, 0x00000004
.equ	ACCESSCTRL_ADC0_SU_MSB, 2
.equ	ACCESSCTRL_ADC0_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ADC0_NSP
# Description : If 1, ADC0 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_ADC0_NSP_RESET, 0x0
.equ	ACCESSCTRL_ADC0_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_ADC0_NSP_MSB, 1
.equ	ACCESSCTRL_ADC0_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ADC0_NSU
# Description : If 1, and NSP is also set, ADC0 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_ADC0_NSU_RESET, 0x0
.equ	ACCESSCTRL_ADC0_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_ADC0_NSU_MSB, 0
.equ	ACCESSCTRL_ADC0_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_HSTX
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               HSTX, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_HSTX_OFFSET, 0x00000080
.equ	ACCESSCTRL_HSTX_BITS, 0x000000ff
.equ	ACCESSCTRL_HSTX_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_HSTX_DBG
# Description : If 1, HSTX can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_HSTX_DBG_RESET, 0x1
.equ	ACCESSCTRL_HSTX_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_HSTX_DBG_MSB, 7
.equ	ACCESSCTRL_HSTX_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_HSTX_DMA
# Description : If 1, HSTX can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_HSTX_DMA_RESET, 0x1
.equ	ACCESSCTRL_HSTX_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_HSTX_DMA_MSB, 6
.equ	ACCESSCTRL_HSTX_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_HSTX_CORE1
# Description : If 1, HSTX can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_HSTX_CORE1_RESET, 0x1
.equ	ACCESSCTRL_HSTX_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_HSTX_CORE1_MSB, 5
.equ	ACCESSCTRL_HSTX_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_HSTX_CORE0
# Description : If 1, HSTX can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_HSTX_CORE0_RESET, 0x1
.equ	ACCESSCTRL_HSTX_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_HSTX_CORE0_MSB, 4
.equ	ACCESSCTRL_HSTX_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_HSTX_SP
# Description : If 1, HSTX can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_HSTX_SP_RESET, 0x1
.equ	ACCESSCTRL_HSTX_SP_BITS, 0x00000008
.equ	ACCESSCTRL_HSTX_SP_MSB, 3
.equ	ACCESSCTRL_HSTX_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_HSTX_SU
# Description : If 1, and SP is also set, HSTX can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_HSTX_SU_RESET, 0x1
.equ	ACCESSCTRL_HSTX_SU_BITS, 0x00000004
.equ	ACCESSCTRL_HSTX_SU_MSB, 2
.equ	ACCESSCTRL_HSTX_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_HSTX_NSP
# Description : If 1, HSTX can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_HSTX_NSP_RESET, 0x0
.equ	ACCESSCTRL_HSTX_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_HSTX_NSP_MSB, 1
.equ	ACCESSCTRL_HSTX_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_HSTX_NSU
# Description : If 1, and NSP is also set, HSTX can be accessed from a Non-
#               secure, Unprivileged context.
#
