konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/accessctrl.inc
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_HSTX_NSU_RESET, 0x0
.equ	ACCESSCTRL_HSTX_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_HSTX_NSU_MSB, 0
.equ	ACCESSCTRL_HSTX_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_I2C0
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               I2C0, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_I2C0_OFFSET, 0x00000084
.equ	ACCESSCTRL_I2C0_BITS, 0x000000ff
.equ	ACCESSCTRL_I2C0_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C0_DBG
# Description : If 1, I2C0 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_I2C0_DBG_RESET, 0x1
.equ	ACCESSCTRL_I2C0_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_I2C0_DBG_MSB, 7
.equ	ACCESSCTRL_I2C0_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C0_DMA
# Description : If 1, I2C0 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_I2C0_DMA_RESET, 0x1
.equ	ACCESSCTRL_I2C0_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_I2C0_DMA_MSB, 6
.equ	ACCESSCTRL_I2C0_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C0_CORE1
# Description : If 1, I2C0 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_I2C0_CORE1_RESET, 0x1
.equ	ACCESSCTRL_I2C0_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_I2C0_CORE1_MSB, 5
.equ	ACCESSCTRL_I2C0_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C0_CORE0
# Description : If 1, I2C0 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_I2C0_CORE0_RESET, 0x1
.equ	ACCESSCTRL_I2C0_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_I2C0_CORE0_MSB, 4
.equ	ACCESSCTRL_I2C0_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C0_SP
# Description : If 1, I2C0 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_I2C0_SP_RESET, 0x1
.equ	ACCESSCTRL_I2C0_SP_BITS, 0x00000008
.equ	ACCESSCTRL_I2C0_SP_MSB, 3
.equ	ACCESSCTRL_I2C0_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C0_SU
# Description : If 1, and SP is also set, I2C0 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_I2C0_SU_RESET, 0x1
.equ	ACCESSCTRL_I2C0_SU_BITS, 0x00000004
.equ	ACCESSCTRL_I2C0_SU_MSB, 2
.equ	ACCESSCTRL_I2C0_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C0_NSP
# Description : If 1, I2C0 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_I2C0_NSP_RESET, 0x0
.equ	ACCESSCTRL_I2C0_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_I2C0_NSP_MSB, 1
.equ	ACCESSCTRL_I2C0_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C0_NSU
# Description : If 1, and NSP is also set, I2C0 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_I2C0_NSU_RESET, 0x0
.equ	ACCESSCTRL_I2C0_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_I2C0_NSU_MSB, 0
.equ	ACCESSCTRL_I2C0_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_I2C1
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               I2C1, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_I2C1_OFFSET, 0x00000088
.equ	ACCESSCTRL_I2C1_BITS, 0x000000ff
.equ	ACCESSCTRL_I2C1_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C1_DBG
# Description : If 1, I2C1 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_I2C1_DBG_RESET, 0x1
.equ	ACCESSCTRL_I2C1_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_I2C1_DBG_MSB, 7
.equ	ACCESSCTRL_I2C1_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C1_DMA
# Description : If 1, I2C1 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_I2C1_DMA_RESET, 0x1
.equ	ACCESSCTRL_I2C1_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_I2C1_DMA_MSB, 6
.equ	ACCESSCTRL_I2C1_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C1_CORE1
# Description : If 1, I2C1 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_I2C1_CORE1_RESET, 0x1
.equ	ACCESSCTRL_I2C1_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_I2C1_CORE1_MSB, 5
.equ	ACCESSCTRL_I2C1_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C1_CORE0
# Description : If 1, I2C1 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_I2C1_CORE0_RESET, 0x1
.equ	ACCESSCTRL_I2C1_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_I2C1_CORE0_MSB, 4
.equ	ACCESSCTRL_I2C1_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C1_SP
# Description : If 1, I2C1 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_I2C1_SP_RESET, 0x1
.equ	ACCESSCTRL_I2C1_SP_BITS, 0x00000008
.equ	ACCESSCTRL_I2C1_SP_MSB, 3
.equ	ACCESSCTRL_I2C1_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C1_SU
# Description : If 1, and SP is also set, I2C1 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_I2C1_SU_RESET, 0x1
.equ	ACCESSCTRL_I2C1_SU_BITS, 0x00000004
.equ	ACCESSCTRL_I2C1_SU_MSB, 2
.equ	ACCESSCTRL_I2C1_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C1_NSP
# Description : If 1, I2C1 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_I2C1_NSP_RESET, 0x0
.equ	ACCESSCTRL_I2C1_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_I2C1_NSP_MSB, 1
.equ	ACCESSCTRL_I2C1_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_I2C1_NSU
# Description : If 1, and NSP is also set, I2C1 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_I2C1_NSU_RESET, 0x0
.equ	ACCESSCTRL_I2C1_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_I2C1_NSU_MSB, 0
.equ	ACCESSCTRL_I2C1_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_PWM
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               PWM, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_PWM_OFFSET, 0x0000008c
.equ	ACCESSCTRL_PWM_BITS, 0x000000ff
.equ	ACCESSCTRL_PWM_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PWM_DBG
# Description : If 1, PWM can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PWM_DBG_RESET, 0x1
.equ	ACCESSCTRL_PWM_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_PWM_DBG_MSB, 7
.equ	ACCESSCTRL_PWM_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PWM_DMA
# Description : If 1, PWM can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PWM_DMA_RESET, 0x1
.equ	ACCESSCTRL_PWM_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_PWM_DMA_MSB, 6
.equ	ACCESSCTRL_PWM_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PWM_CORE1
# Description : If 1, PWM can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PWM_CORE1_RESET, 0x1
.equ	ACCESSCTRL_PWM_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_PWM_CORE1_MSB, 5
.equ	ACCESSCTRL_PWM_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PWM_CORE0
# Description : If 1, PWM can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PWM_CORE0_RESET, 0x1
.equ	ACCESSCTRL_PWM_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_PWM_CORE0_MSB, 4
.equ	ACCESSCTRL_PWM_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PWM_SP
# Description : If 1, PWM can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_PWM_SP_RESET, 0x1
.equ	ACCESSCTRL_PWM_SP_BITS, 0x00000008
.equ	ACCESSCTRL_PWM_SP_MSB, 3
.equ	ACCESSCTRL_PWM_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PWM_SU
# Description : If 1, and SP is also set, PWM can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_PWM_SU_RESET, 0x1
.equ	ACCESSCTRL_PWM_SU_BITS, 0x00000004
.equ	ACCESSCTRL_PWM_SU_MSB, 2
.equ	ACCESSCTRL_PWM_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PWM_NSP
# Description : If 1, PWM can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_PWM_NSP_RESET, 0x0
.equ	ACCESSCTRL_PWM_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_PWM_NSP_MSB, 1
.equ	ACCESSCTRL_PWM_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PWM_NSU
# Description : If 1, and NSP is also set, PWM can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_PWM_NSU_RESET, 0x0
.equ	ACCESSCTRL_PWM_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_PWM_NSU_MSB, 0
.equ	ACCESSCTRL_PWM_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SPI0
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SPI0, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SPI0_OFFSET, 0x00000090
.equ	ACCESSCTRL_SPI0_BITS, 0x000000ff
.equ	ACCESSCTRL_SPI0_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI0_DBG
# Description : If 1, SPI0 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SPI0_DBG_RESET, 0x1
.equ	ACCESSCTRL_SPI0_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SPI0_DBG_MSB, 7
.equ	ACCESSCTRL_SPI0_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI0_DMA
# Description : If 1, SPI0 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SPI0_DMA_RESET, 0x1
.equ	ACCESSCTRL_SPI0_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SPI0_DMA_MSB, 6
.equ	ACCESSCTRL_SPI0_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI0_CORE1
# Description : If 1, SPI0 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SPI0_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SPI0_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SPI0_CORE1_MSB, 5
.equ	ACCESSCTRL_SPI0_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI0_CORE0
# Description : If 1, SPI0 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SPI0_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SPI0_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SPI0_CORE0_MSB, 4
.equ	ACCESSCTRL_SPI0_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI0_SP
# Description : If 1, SPI0 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SPI0_SP_RESET, 0x1
.equ	ACCESSCTRL_SPI0_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SPI0_SP_MSB, 3
.equ	ACCESSCTRL_SPI0_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI0_SU
# Description : If 1, and SP is also set, SPI0 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SPI0_SU_RESET, 0x1
.equ	ACCESSCTRL_SPI0_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SPI0_SU_MSB, 2
.equ	ACCESSCTRL_SPI0_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI0_NSP
# Description : If 1, SPI0 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SPI0_NSP_RESET, 0x0
.equ	ACCESSCTRL_SPI0_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SPI0_NSP_MSB, 1
.equ	ACCESSCTRL_SPI0_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI0_NSU
# Description : If 1, and NSP is also set, SPI0 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SPI0_NSU_RESET, 0x0
.equ	ACCESSCTRL_SPI0_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SPI0_NSU_MSB, 0
.equ	ACCESSCTRL_SPI0_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SPI1
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SPI1, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SPI1_OFFSET, 0x00000094
.equ	ACCESSCTRL_SPI1_BITS, 0x000000ff
.equ	ACCESSCTRL_SPI1_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI1_DBG
# Description : If 1, SPI1 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SPI1_DBG_RESET, 0x1
.equ	ACCESSCTRL_SPI1_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SPI1_DBG_MSB, 7
.equ	ACCESSCTRL_SPI1_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI1_DMA
# Description : If 1, SPI1 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SPI1_DMA_RESET, 0x1
.equ	ACCESSCTRL_SPI1_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SPI1_DMA_MSB, 6
.equ	ACCESSCTRL_SPI1_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI1_CORE1
# Description : If 1, SPI1 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SPI1_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SPI1_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SPI1_CORE1_MSB, 5
.equ	ACCESSCTRL_SPI1_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI1_CORE0
# Description : If 1, SPI1 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SPI1_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SPI1_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SPI1_CORE0_MSB, 4
.equ	ACCESSCTRL_SPI1_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI1_SP
# Description : If 1, SPI1 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SPI1_SP_RESET, 0x1
.equ	ACCESSCTRL_SPI1_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SPI1_SP_MSB, 3
.equ	ACCESSCTRL_SPI1_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI1_SU
# Description : If 1, and SP is also set, SPI1 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SPI1_SU_RESET, 0x1
.equ	ACCESSCTRL_SPI1_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SPI1_SU_MSB, 2
.equ	ACCESSCTRL_SPI1_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI1_NSP
# Description : If 1, SPI1 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SPI1_NSP_RESET, 0x0
.equ	ACCESSCTRL_SPI1_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SPI1_NSP_MSB, 1
.equ	ACCESSCTRL_SPI1_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SPI1_NSU
# Description : If 1, and NSP is also set, SPI1 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SPI1_NSU_RESET, 0x0
.equ	ACCESSCTRL_SPI1_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SPI1_NSU_MSB, 0
.equ	ACCESSCTRL_SPI1_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_TIMER0
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               TIMER0, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_TIMER0_OFFSET, 0x00000098
.equ	ACCESSCTRL_TIMER0_BITS, 0x000000ff
.equ	ACCESSCTRL_TIMER0_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER0_DBG
# Description : If 1, TIMER0 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_TIMER0_DBG_RESET, 0x1
.equ	ACCESSCTRL_TIMER0_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_TIMER0_DBG_MSB, 7
.equ	ACCESSCTRL_TIMER0_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER0_DMA
# Description : If 1, TIMER0 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TIMER0_DMA_RESET, 0x1
.equ	ACCESSCTRL_TIMER0_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_TIMER0_DMA_MSB, 6
.equ	ACCESSCTRL_TIMER0_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER0_CORE1
# Description : If 1, TIMER0 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TIMER0_CORE1_RESET, 0x1
.equ	ACCESSCTRL_TIMER0_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_TIMER0_CORE1_MSB, 5
.equ	ACCESSCTRL_TIMER0_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER0_CORE0
# Description : If 1, TIMER0 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TIMER0_CORE0_RESET, 0x1
.equ	ACCESSCTRL_TIMER0_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_TIMER0_CORE0_MSB, 4
.equ	ACCESSCTRL_TIMER0_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER0_SP
# Description : If 1, TIMER0 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_TIMER0_SP_RESET, 0x1
.equ	ACCESSCTRL_TIMER0_SP_BITS, 0x00000008
.equ	ACCESSCTRL_TIMER0_SP_MSB, 3
.equ	ACCESSCTRL_TIMER0_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER0_SU
# Description : If 1, and SP is also set, TIMER0 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_TIMER0_SU_RESET, 0x1
.equ	ACCESSCTRL_TIMER0_SU_BITS, 0x00000004
.equ	ACCESSCTRL_TIMER0_SU_MSB, 2
.equ	ACCESSCTRL_TIMER0_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER0_NSP
# Description : If 1, TIMER0 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_TIMER0_NSP_RESET, 0x0
.equ	ACCESSCTRL_TIMER0_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_TIMER0_NSP_MSB, 1
.equ	ACCESSCTRL_TIMER0_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER0_NSU
# Description : If 1, and NSP is also set, TIMER0 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_TIMER0_NSU_RESET, 0x0
.equ	ACCESSCTRL_TIMER0_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_TIMER0_NSU_MSB, 0
.equ	ACCESSCTRL_TIMER0_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_TIMER1
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               TIMER1, and at what security/privilege levels they can do so.
#
