konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/accessctrl.inc
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_TIMER1_OFFSET, 0x0000009c
.equ	ACCESSCTRL_TIMER1_BITS, 0x000000ff
.equ	ACCESSCTRL_TIMER1_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER1_DBG
# Description : If 1, TIMER1 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_TIMER1_DBG_RESET, 0x1
.equ	ACCESSCTRL_TIMER1_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_TIMER1_DBG_MSB, 7
.equ	ACCESSCTRL_TIMER1_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER1_DMA
# Description : If 1, TIMER1 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TIMER1_DMA_RESET, 0x1
.equ	ACCESSCTRL_TIMER1_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_TIMER1_DMA_MSB, 6
.equ	ACCESSCTRL_TIMER1_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER1_CORE1
# Description : If 1, TIMER1 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TIMER1_CORE1_RESET, 0x1
.equ	ACCESSCTRL_TIMER1_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_TIMER1_CORE1_MSB, 5
.equ	ACCESSCTRL_TIMER1_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER1_CORE0
# Description : If 1, TIMER1 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TIMER1_CORE0_RESET, 0x1
.equ	ACCESSCTRL_TIMER1_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_TIMER1_CORE0_MSB, 4
.equ	ACCESSCTRL_TIMER1_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER1_SP
# Description : If 1, TIMER1 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_TIMER1_SP_RESET, 0x1
.equ	ACCESSCTRL_TIMER1_SP_BITS, 0x00000008
.equ	ACCESSCTRL_TIMER1_SP_MSB, 3
.equ	ACCESSCTRL_TIMER1_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER1_SU
# Description : If 1, and SP is also set, TIMER1 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_TIMER1_SU_RESET, 0x1
.equ	ACCESSCTRL_TIMER1_SU_BITS, 0x00000004
.equ	ACCESSCTRL_TIMER1_SU_MSB, 2
.equ	ACCESSCTRL_TIMER1_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER1_NSP
# Description : If 1, TIMER1 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_TIMER1_NSP_RESET, 0x0
.equ	ACCESSCTRL_TIMER1_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_TIMER1_NSP_MSB, 1
.equ	ACCESSCTRL_TIMER1_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TIMER1_NSU
# Description : If 1, and NSP is also set, TIMER1 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_TIMER1_NSU_RESET, 0x0
.equ	ACCESSCTRL_TIMER1_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_TIMER1_NSU_MSB, 0
.equ	ACCESSCTRL_TIMER1_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_UART0
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               UART0, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_UART0_OFFSET, 0x000000a0
.equ	ACCESSCTRL_UART0_BITS, 0x000000ff
.equ	ACCESSCTRL_UART0_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART0_DBG
# Description : If 1, UART0 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_UART0_DBG_RESET, 0x1
.equ	ACCESSCTRL_UART0_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_UART0_DBG_MSB, 7
.equ	ACCESSCTRL_UART0_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART0_DMA
# Description : If 1, UART0 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_UART0_DMA_RESET, 0x1
.equ	ACCESSCTRL_UART0_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_UART0_DMA_MSB, 6
.equ	ACCESSCTRL_UART0_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART0_CORE1
# Description : If 1, UART0 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_UART0_CORE1_RESET, 0x1
.equ	ACCESSCTRL_UART0_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_UART0_CORE1_MSB, 5
.equ	ACCESSCTRL_UART0_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART0_CORE0
# Description : If 1, UART0 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_UART0_CORE0_RESET, 0x1
.equ	ACCESSCTRL_UART0_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_UART0_CORE0_MSB, 4
.equ	ACCESSCTRL_UART0_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART0_SP
# Description : If 1, UART0 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_UART0_SP_RESET, 0x1
.equ	ACCESSCTRL_UART0_SP_BITS, 0x00000008
.equ	ACCESSCTRL_UART0_SP_MSB, 3
.equ	ACCESSCTRL_UART0_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART0_SU
# Description : If 1, and SP is also set, UART0 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_UART0_SU_RESET, 0x1
.equ	ACCESSCTRL_UART0_SU_BITS, 0x00000004
.equ	ACCESSCTRL_UART0_SU_MSB, 2
.equ	ACCESSCTRL_UART0_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART0_NSP
# Description : If 1, UART0 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_UART0_NSP_RESET, 0x0
.equ	ACCESSCTRL_UART0_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_UART0_NSP_MSB, 1
.equ	ACCESSCTRL_UART0_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART0_NSU
# Description : If 1, and NSP is also set, UART0 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_UART0_NSU_RESET, 0x0
.equ	ACCESSCTRL_UART0_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_UART0_NSU_MSB, 0
.equ	ACCESSCTRL_UART0_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_UART1
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               UART1, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_UART1_OFFSET, 0x000000a4
.equ	ACCESSCTRL_UART1_BITS, 0x000000ff
.equ	ACCESSCTRL_UART1_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART1_DBG
# Description : If 1, UART1 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_UART1_DBG_RESET, 0x1
.equ	ACCESSCTRL_UART1_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_UART1_DBG_MSB, 7
.equ	ACCESSCTRL_UART1_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART1_DMA
# Description : If 1, UART1 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_UART1_DMA_RESET, 0x1
.equ	ACCESSCTRL_UART1_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_UART1_DMA_MSB, 6
.equ	ACCESSCTRL_UART1_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART1_CORE1
# Description : If 1, UART1 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_UART1_CORE1_RESET, 0x1
.equ	ACCESSCTRL_UART1_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_UART1_CORE1_MSB, 5
.equ	ACCESSCTRL_UART1_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART1_CORE0
# Description : If 1, UART1 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_UART1_CORE0_RESET, 0x1
.equ	ACCESSCTRL_UART1_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_UART1_CORE0_MSB, 4
.equ	ACCESSCTRL_UART1_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART1_SP
# Description : If 1, UART1 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_UART1_SP_RESET, 0x1
.equ	ACCESSCTRL_UART1_SP_BITS, 0x00000008
.equ	ACCESSCTRL_UART1_SP_MSB, 3
.equ	ACCESSCTRL_UART1_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART1_SU
# Description : If 1, and SP is also set, UART1 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_UART1_SU_RESET, 0x1
.equ	ACCESSCTRL_UART1_SU_BITS, 0x00000004
.equ	ACCESSCTRL_UART1_SU_MSB, 2
.equ	ACCESSCTRL_UART1_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART1_NSP
# Description : If 1, UART1 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_UART1_NSP_RESET, 0x0
.equ	ACCESSCTRL_UART1_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_UART1_NSP_MSB, 1
.equ	ACCESSCTRL_UART1_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_UART1_NSU
# Description : If 1, and NSP is also set, UART1 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_UART1_NSU_RESET, 0x0
.equ	ACCESSCTRL_UART1_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_UART1_NSU_MSB, 0
.equ	ACCESSCTRL_UART1_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_OTP
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               OTP, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_OTP_OFFSET, 0x000000a8
.equ	ACCESSCTRL_OTP_BITS, 0x000000ff
.equ	ACCESSCTRL_OTP_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_OTP_DBG
# Description : If 1, OTP can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_OTP_DBG_RESET, 0x1
.equ	ACCESSCTRL_OTP_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_OTP_DBG_MSB, 7
.equ	ACCESSCTRL_OTP_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_OTP_DMA
# Description : If 1, OTP can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_OTP_DMA_RESET, 0x1
.equ	ACCESSCTRL_OTP_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_OTP_DMA_MSB, 6
.equ	ACCESSCTRL_OTP_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_OTP_CORE1
# Description : If 1, OTP can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_OTP_CORE1_RESET, 0x1
.equ	ACCESSCTRL_OTP_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_OTP_CORE1_MSB, 5
.equ	ACCESSCTRL_OTP_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_OTP_CORE0
# Description : If 1, OTP can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_OTP_CORE0_RESET, 0x1
.equ	ACCESSCTRL_OTP_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_OTP_CORE0_MSB, 4
.equ	ACCESSCTRL_OTP_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_OTP_SP
# Description : If 1, OTP can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_OTP_SP_RESET, 0x1
.equ	ACCESSCTRL_OTP_SP_BITS, 0x00000008
.equ	ACCESSCTRL_OTP_SP_MSB, 3
.equ	ACCESSCTRL_OTP_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_OTP_SU
# Description : If 1, and SP is also set, OTP can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_OTP_SU_RESET, 0x1
.equ	ACCESSCTRL_OTP_SU_BITS, 0x00000004
.equ	ACCESSCTRL_OTP_SU_MSB, 2
.equ	ACCESSCTRL_OTP_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_OTP_NSP
# Description : If 1, OTP can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_OTP_NSP_RESET, 0x0
.equ	ACCESSCTRL_OTP_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_OTP_NSP_MSB, 1
.equ	ACCESSCTRL_OTP_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_OTP_NSU
# Description : If 1, and NSP is also set, OTP can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_OTP_NSU_RESET, 0x0
.equ	ACCESSCTRL_OTP_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_OTP_NSU_MSB, 0
.equ	ACCESSCTRL_OTP_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_TBMAN
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               TBMAN, and at what security/privilege levels they can do so.
#
#               Defaults to Secure access from any master.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_TBMAN_OFFSET, 0x000000ac
.equ	ACCESSCTRL_TBMAN_BITS, 0x000000ff
.equ	ACCESSCTRL_TBMAN_RESET, 0x000000fc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TBMAN_DBG
# Description : If 1, TBMAN can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_TBMAN_DBG_RESET, 0x1
.equ	ACCESSCTRL_TBMAN_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_TBMAN_DBG_MSB, 7
.equ	ACCESSCTRL_TBMAN_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TBMAN_DMA
# Description : If 1, TBMAN can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TBMAN_DMA_RESET, 0x1
.equ	ACCESSCTRL_TBMAN_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_TBMAN_DMA_MSB, 6
.equ	ACCESSCTRL_TBMAN_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TBMAN_CORE1
# Description : If 1, TBMAN can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TBMAN_CORE1_RESET, 0x1
.equ	ACCESSCTRL_TBMAN_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_TBMAN_CORE1_MSB, 5
.equ	ACCESSCTRL_TBMAN_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TBMAN_CORE0
# Description : If 1, TBMAN can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TBMAN_CORE0_RESET, 0x1
.equ	ACCESSCTRL_TBMAN_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_TBMAN_CORE0_MSB, 4
.equ	ACCESSCTRL_TBMAN_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TBMAN_SP
# Description : If 1, TBMAN can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_TBMAN_SP_RESET, 0x1
.equ	ACCESSCTRL_TBMAN_SP_BITS, 0x00000008
.equ	ACCESSCTRL_TBMAN_SP_MSB, 3
.equ	ACCESSCTRL_TBMAN_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TBMAN_SU
# Description : If 1, and SP is also set, TBMAN can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_TBMAN_SU_RESET, 0x1
.equ	ACCESSCTRL_TBMAN_SU_BITS, 0x00000004
.equ	ACCESSCTRL_TBMAN_SU_MSB, 2
.equ	ACCESSCTRL_TBMAN_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TBMAN_NSP
# Description : If 1, TBMAN can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_TBMAN_NSP_RESET, 0x0
.equ	ACCESSCTRL_TBMAN_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_TBMAN_NSP_MSB, 1
.equ	ACCESSCTRL_TBMAN_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TBMAN_NSU
# Description : If 1, and NSP is also set, TBMAN can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_TBMAN_NSU_RESET, 0x0
.equ	ACCESSCTRL_TBMAN_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_TBMAN_NSU_MSB, 0
.equ	ACCESSCTRL_TBMAN_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_POWMAN
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               POWMAN, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_POWMAN_OFFSET, 0x000000b0
.equ	ACCESSCTRL_POWMAN_BITS, 0x000000ff
.equ	ACCESSCTRL_POWMAN_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_POWMAN_DBG
# Description : If 1, POWMAN can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_POWMAN_DBG_RESET, 0x1
.equ	ACCESSCTRL_POWMAN_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_POWMAN_DBG_MSB, 7
.equ	ACCESSCTRL_POWMAN_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_POWMAN_DMA
# Description : If 1, POWMAN can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_POWMAN_DMA_RESET, 0x0
.equ	ACCESSCTRL_POWMAN_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_POWMAN_DMA_MSB, 6
.equ	ACCESSCTRL_POWMAN_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_POWMAN_CORE1
# Description : If 1, POWMAN can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_POWMAN_CORE1_RESET, 0x1
.equ	ACCESSCTRL_POWMAN_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_POWMAN_CORE1_MSB, 5
.equ	ACCESSCTRL_POWMAN_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_POWMAN_CORE0
# Description : If 1, POWMAN can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_POWMAN_CORE0_RESET, 0x1
.equ	ACCESSCTRL_POWMAN_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_POWMAN_CORE0_MSB, 4
.equ	ACCESSCTRL_POWMAN_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_POWMAN_SP
# Description : If 1, POWMAN can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_POWMAN_SP_RESET, 0x1
.equ	ACCESSCTRL_POWMAN_SP_BITS, 0x00000008
.equ	ACCESSCTRL_POWMAN_SP_MSB, 3
.equ	ACCESSCTRL_POWMAN_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_POWMAN_SU
# Description : If 1, and SP is also set, POWMAN can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_POWMAN_SU_RESET, 0x0
.equ	ACCESSCTRL_POWMAN_SU_BITS, 0x00000004
.equ	ACCESSCTRL_POWMAN_SU_MSB, 2
.equ	ACCESSCTRL_POWMAN_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_POWMAN_NSP
# Description : If 1, POWMAN can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_POWMAN_NSP_RESET, 0x0
.equ	ACCESSCTRL_POWMAN_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_POWMAN_NSP_MSB, 1
.equ	ACCESSCTRL_POWMAN_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_POWMAN_NSU
# Description : If 1, and NSP is also set, POWMAN can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_POWMAN_NSU_RESET, 0x0
.equ	ACCESSCTRL_POWMAN_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_POWMAN_NSU_MSB, 0
.equ	ACCESSCTRL_POWMAN_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_TRNG
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               TRNG, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
