konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/accessctrl.inc
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_TRNG_OFFSET, 0x000000b4
.equ	ACCESSCTRL_TRNG_BITS, 0x000000ff
.equ	ACCESSCTRL_TRNG_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TRNG_DBG
# Description : If 1, TRNG can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_TRNG_DBG_RESET, 0x1
.equ	ACCESSCTRL_TRNG_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_TRNG_DBG_MSB, 7
.equ	ACCESSCTRL_TRNG_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TRNG_DMA
# Description : If 1, TRNG can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TRNG_DMA_RESET, 0x0
.equ	ACCESSCTRL_TRNG_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_TRNG_DMA_MSB, 6
.equ	ACCESSCTRL_TRNG_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TRNG_CORE1
# Description : If 1, TRNG can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TRNG_CORE1_RESET, 0x1
.equ	ACCESSCTRL_TRNG_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_TRNG_CORE1_MSB, 5
.equ	ACCESSCTRL_TRNG_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TRNG_CORE0
# Description : If 1, TRNG can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TRNG_CORE0_RESET, 0x1
.equ	ACCESSCTRL_TRNG_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_TRNG_CORE0_MSB, 4
.equ	ACCESSCTRL_TRNG_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TRNG_SP
# Description : If 1, TRNG can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_TRNG_SP_RESET, 0x1
.equ	ACCESSCTRL_TRNG_SP_BITS, 0x00000008
.equ	ACCESSCTRL_TRNG_SP_MSB, 3
.equ	ACCESSCTRL_TRNG_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TRNG_SU
# Description : If 1, and SP is also set, TRNG can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_TRNG_SU_RESET, 0x0
.equ	ACCESSCTRL_TRNG_SU_BITS, 0x00000004
.equ	ACCESSCTRL_TRNG_SU_MSB, 2
.equ	ACCESSCTRL_TRNG_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TRNG_NSP
# Description : If 1, TRNG can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_TRNG_NSP_RESET, 0x0
.equ	ACCESSCTRL_TRNG_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_TRNG_NSP_MSB, 1
.equ	ACCESSCTRL_TRNG_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TRNG_NSU
# Description : If 1, and NSP is also set, TRNG can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_TRNG_NSU_RESET, 0x0
.equ	ACCESSCTRL_TRNG_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_TRNG_NSU_MSB, 0
.equ	ACCESSCTRL_TRNG_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SHA256
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SHA256, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SHA256_OFFSET, 0x000000b8
.equ	ACCESSCTRL_SHA256_BITS, 0x000000ff
.equ	ACCESSCTRL_SHA256_RESET, 0x000000f8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SHA256_DBG
# Description : If 1, SHA256 can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SHA256_DBG_RESET, 0x1
.equ	ACCESSCTRL_SHA256_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SHA256_DBG_MSB, 7
.equ	ACCESSCTRL_SHA256_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SHA256_DMA
# Description : If 1, SHA256 can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SHA256_DMA_RESET, 0x1
.equ	ACCESSCTRL_SHA256_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SHA256_DMA_MSB, 6
.equ	ACCESSCTRL_SHA256_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SHA256_CORE1
# Description : If 1, SHA256 can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SHA256_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SHA256_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SHA256_CORE1_MSB, 5
.equ	ACCESSCTRL_SHA256_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SHA256_CORE0
# Description : If 1, SHA256 can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SHA256_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SHA256_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SHA256_CORE0_MSB, 4
.equ	ACCESSCTRL_SHA256_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SHA256_SP
# Description : If 1, SHA256 can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SHA256_SP_RESET, 0x1
.equ	ACCESSCTRL_SHA256_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SHA256_SP_MSB, 3
.equ	ACCESSCTRL_SHA256_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SHA256_SU
# Description : If 1, and SP is also set, SHA256 can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SHA256_SU_RESET, 0x0
.equ	ACCESSCTRL_SHA256_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SHA256_SU_MSB, 2
.equ	ACCESSCTRL_SHA256_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SHA256_NSP
# Description : If 1, SHA256 can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SHA256_NSP_RESET, 0x0
.equ	ACCESSCTRL_SHA256_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SHA256_NSP_MSB, 1
.equ	ACCESSCTRL_SHA256_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SHA256_NSU
# Description : If 1, and NSP is also set, SHA256 can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SHA256_NSU_RESET, 0x0
.equ	ACCESSCTRL_SHA256_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SHA256_NSU_MSB, 0
.equ	ACCESSCTRL_SHA256_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_SYSCFG
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               SYSCFG, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_SYSCFG_OFFSET, 0x000000bc
.equ	ACCESSCTRL_SYSCFG_BITS, 0x000000ff
.equ	ACCESSCTRL_SYSCFG_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSCFG_DBG
# Description : If 1, SYSCFG can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_SYSCFG_DBG_RESET, 0x1
.equ	ACCESSCTRL_SYSCFG_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_SYSCFG_DBG_MSB, 7
.equ	ACCESSCTRL_SYSCFG_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSCFG_DMA
# Description : If 1, SYSCFG can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SYSCFG_DMA_RESET, 0x0
.equ	ACCESSCTRL_SYSCFG_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_SYSCFG_DMA_MSB, 6
.equ	ACCESSCTRL_SYSCFG_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSCFG_CORE1
# Description : If 1, SYSCFG can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SYSCFG_CORE1_RESET, 0x1
.equ	ACCESSCTRL_SYSCFG_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_SYSCFG_CORE1_MSB, 5
.equ	ACCESSCTRL_SYSCFG_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSCFG_CORE0
# Description : If 1, SYSCFG can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_SYSCFG_CORE0_RESET, 0x1
.equ	ACCESSCTRL_SYSCFG_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_SYSCFG_CORE0_MSB, 4
.equ	ACCESSCTRL_SYSCFG_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSCFG_SP
# Description : If 1, SYSCFG can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_SYSCFG_SP_RESET, 0x1
.equ	ACCESSCTRL_SYSCFG_SP_BITS, 0x00000008
.equ	ACCESSCTRL_SYSCFG_SP_MSB, 3
.equ	ACCESSCTRL_SYSCFG_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSCFG_SU
# Description : If 1, and SP is also set, SYSCFG can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_SYSCFG_SU_RESET, 0x0
.equ	ACCESSCTRL_SYSCFG_SU_BITS, 0x00000004
.equ	ACCESSCTRL_SYSCFG_SU_MSB, 2
.equ	ACCESSCTRL_SYSCFG_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSCFG_NSP
# Description : If 1, SYSCFG can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_SYSCFG_NSP_RESET, 0x0
.equ	ACCESSCTRL_SYSCFG_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_SYSCFG_NSP_MSB, 1
.equ	ACCESSCTRL_SYSCFG_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_SYSCFG_NSU
# Description : If 1, and NSP is also set, SYSCFG can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_SYSCFG_NSU_RESET, 0x0
.equ	ACCESSCTRL_SYSCFG_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_SYSCFG_NSU_MSB, 0
.equ	ACCESSCTRL_SYSCFG_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_CLOCKS
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               CLOCKS, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_CLOCKS_OFFSET, 0x000000c0
.equ	ACCESSCTRL_CLOCKS_BITS, 0x000000ff
.equ	ACCESSCTRL_CLOCKS_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CLOCKS_DBG
# Description : If 1, CLOCKS can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_CLOCKS_DBG_RESET, 0x1
.equ	ACCESSCTRL_CLOCKS_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_CLOCKS_DBG_MSB, 7
.equ	ACCESSCTRL_CLOCKS_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CLOCKS_DMA
# Description : If 1, CLOCKS can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_CLOCKS_DMA_RESET, 0x0
.equ	ACCESSCTRL_CLOCKS_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_CLOCKS_DMA_MSB, 6
.equ	ACCESSCTRL_CLOCKS_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CLOCKS_CORE1
# Description : If 1, CLOCKS can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_CLOCKS_CORE1_RESET, 0x1
.equ	ACCESSCTRL_CLOCKS_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_CLOCKS_CORE1_MSB, 5
.equ	ACCESSCTRL_CLOCKS_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CLOCKS_CORE0
# Description : If 1, CLOCKS can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_CLOCKS_CORE0_RESET, 0x1
.equ	ACCESSCTRL_CLOCKS_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_CLOCKS_CORE0_MSB, 4
.equ	ACCESSCTRL_CLOCKS_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CLOCKS_SP
# Description : If 1, CLOCKS can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_CLOCKS_SP_RESET, 0x1
.equ	ACCESSCTRL_CLOCKS_SP_BITS, 0x00000008
.equ	ACCESSCTRL_CLOCKS_SP_MSB, 3
.equ	ACCESSCTRL_CLOCKS_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CLOCKS_SU
# Description : If 1, and SP is also set, CLOCKS can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_CLOCKS_SU_RESET, 0x0
.equ	ACCESSCTRL_CLOCKS_SU_BITS, 0x00000004
.equ	ACCESSCTRL_CLOCKS_SU_MSB, 2
.equ	ACCESSCTRL_CLOCKS_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CLOCKS_NSP
# Description : If 1, CLOCKS can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_CLOCKS_NSP_RESET, 0x0
.equ	ACCESSCTRL_CLOCKS_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_CLOCKS_NSP_MSB, 1
.equ	ACCESSCTRL_CLOCKS_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_CLOCKS_NSU
# Description : If 1, and NSP is also set, CLOCKS can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_CLOCKS_NSU_RESET, 0x0
.equ	ACCESSCTRL_CLOCKS_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_CLOCKS_NSU_MSB, 0
.equ	ACCESSCTRL_CLOCKS_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_XOSC
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               XOSC, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_XOSC_OFFSET, 0x000000c4
.equ	ACCESSCTRL_XOSC_BITS, 0x000000ff
.equ	ACCESSCTRL_XOSC_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XOSC_DBG
# Description : If 1, XOSC can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_XOSC_DBG_RESET, 0x1
.equ	ACCESSCTRL_XOSC_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_XOSC_DBG_MSB, 7
.equ	ACCESSCTRL_XOSC_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XOSC_DMA
# Description : If 1, XOSC can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XOSC_DMA_RESET, 0x0
.equ	ACCESSCTRL_XOSC_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_XOSC_DMA_MSB, 6
.equ	ACCESSCTRL_XOSC_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XOSC_CORE1
# Description : If 1, XOSC can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XOSC_CORE1_RESET, 0x1
.equ	ACCESSCTRL_XOSC_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_XOSC_CORE1_MSB, 5
.equ	ACCESSCTRL_XOSC_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XOSC_CORE0
# Description : If 1, XOSC can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XOSC_CORE0_RESET, 0x1
.equ	ACCESSCTRL_XOSC_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_XOSC_CORE0_MSB, 4
.equ	ACCESSCTRL_XOSC_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XOSC_SP
# Description : If 1, XOSC can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_XOSC_SP_RESET, 0x1
.equ	ACCESSCTRL_XOSC_SP_BITS, 0x00000008
.equ	ACCESSCTRL_XOSC_SP_MSB, 3
.equ	ACCESSCTRL_XOSC_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XOSC_SU
# Description : If 1, and SP is also set, XOSC can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_XOSC_SU_RESET, 0x0
.equ	ACCESSCTRL_XOSC_SU_BITS, 0x00000004
.equ	ACCESSCTRL_XOSC_SU_MSB, 2
.equ	ACCESSCTRL_XOSC_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XOSC_NSP
# Description : If 1, XOSC can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_XOSC_NSP_RESET, 0x0
.equ	ACCESSCTRL_XOSC_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_XOSC_NSP_MSB, 1
.equ	ACCESSCTRL_XOSC_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XOSC_NSU
# Description : If 1, and NSP is also set, XOSC can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_XOSC_NSU_RESET, 0x0
.equ	ACCESSCTRL_XOSC_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_XOSC_NSU_MSB, 0
.equ	ACCESSCTRL_XOSC_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_ROSC
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               ROSC, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_ROSC_OFFSET, 0x000000c8
.equ	ACCESSCTRL_ROSC_BITS, 0x000000ff
.equ	ACCESSCTRL_ROSC_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROSC_DBG
# Description : If 1, ROSC can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_ROSC_DBG_RESET, 0x1
.equ	ACCESSCTRL_ROSC_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_ROSC_DBG_MSB, 7
.equ	ACCESSCTRL_ROSC_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROSC_DMA
# Description : If 1, ROSC can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_ROSC_DMA_RESET, 0x0
.equ	ACCESSCTRL_ROSC_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_ROSC_DMA_MSB, 6
.equ	ACCESSCTRL_ROSC_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROSC_CORE1
# Description : If 1, ROSC can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_ROSC_CORE1_RESET, 0x1
.equ	ACCESSCTRL_ROSC_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_ROSC_CORE1_MSB, 5
.equ	ACCESSCTRL_ROSC_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROSC_CORE0
# Description : If 1, ROSC can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_ROSC_CORE0_RESET, 0x1
.equ	ACCESSCTRL_ROSC_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_ROSC_CORE0_MSB, 4
.equ	ACCESSCTRL_ROSC_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROSC_SP
# Description : If 1, ROSC can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_ROSC_SP_RESET, 0x1
.equ	ACCESSCTRL_ROSC_SP_BITS, 0x00000008
.equ	ACCESSCTRL_ROSC_SP_MSB, 3
.equ	ACCESSCTRL_ROSC_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROSC_SU
# Description : If 1, and SP is also set, ROSC can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_ROSC_SU_RESET, 0x0
.equ	ACCESSCTRL_ROSC_SU_BITS, 0x00000004
.equ	ACCESSCTRL_ROSC_SU_MSB, 2
.equ	ACCESSCTRL_ROSC_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROSC_NSP
# Description : If 1, ROSC can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_ROSC_NSP_RESET, 0x0
.equ	ACCESSCTRL_ROSC_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_ROSC_NSP_MSB, 1
.equ	ACCESSCTRL_ROSC_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_ROSC_NSU
# Description : If 1, and NSP is also set, ROSC can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_ROSC_NSU_RESET, 0x0
.equ	ACCESSCTRL_ROSC_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_ROSC_NSU_MSB, 0
.equ	ACCESSCTRL_ROSC_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_PLL_SYS
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               PLL_SYS, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_PLL_SYS_OFFSET, 0x000000cc
.equ	ACCESSCTRL_PLL_SYS_BITS, 0x000000ff
.equ	ACCESSCTRL_PLL_SYS_RESET, 0x000000b8
