konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/accessctrl.inc
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_SYS_DBG
# Description : If 1, PLL_SYS can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PLL_SYS_DBG_RESET, 0x1
.equ	ACCESSCTRL_PLL_SYS_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_PLL_SYS_DBG_MSB, 7
.equ	ACCESSCTRL_PLL_SYS_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_SYS_DMA
# Description : If 1, PLL_SYS can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PLL_SYS_DMA_RESET, 0x0
.equ	ACCESSCTRL_PLL_SYS_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_PLL_SYS_DMA_MSB, 6
.equ	ACCESSCTRL_PLL_SYS_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_SYS_CORE1
# Description : If 1, PLL_SYS can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PLL_SYS_CORE1_RESET, 0x1
.equ	ACCESSCTRL_PLL_SYS_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_PLL_SYS_CORE1_MSB, 5
.equ	ACCESSCTRL_PLL_SYS_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_SYS_CORE0
# Description : If 1, PLL_SYS can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PLL_SYS_CORE0_RESET, 0x1
.equ	ACCESSCTRL_PLL_SYS_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_PLL_SYS_CORE0_MSB, 4
.equ	ACCESSCTRL_PLL_SYS_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_SYS_SP
# Description : If 1, PLL_SYS can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_PLL_SYS_SP_RESET, 0x1
.equ	ACCESSCTRL_PLL_SYS_SP_BITS, 0x00000008
.equ	ACCESSCTRL_PLL_SYS_SP_MSB, 3
.equ	ACCESSCTRL_PLL_SYS_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_SYS_SU
# Description : If 1, and SP is also set, PLL_SYS can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_PLL_SYS_SU_RESET, 0x0
.equ	ACCESSCTRL_PLL_SYS_SU_BITS, 0x00000004
.equ	ACCESSCTRL_PLL_SYS_SU_MSB, 2
.equ	ACCESSCTRL_PLL_SYS_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_SYS_NSP
# Description : If 1, PLL_SYS can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_PLL_SYS_NSP_RESET, 0x0
.equ	ACCESSCTRL_PLL_SYS_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_PLL_SYS_NSP_MSB, 1
.equ	ACCESSCTRL_PLL_SYS_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_SYS_NSU
# Description : If 1, and NSP is also set, PLL_SYS can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_PLL_SYS_NSU_RESET, 0x0
.equ	ACCESSCTRL_PLL_SYS_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_PLL_SYS_NSU_MSB, 0
.equ	ACCESSCTRL_PLL_SYS_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_PLL_USB
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               PLL_USB, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_PLL_USB_OFFSET, 0x000000d0
.equ	ACCESSCTRL_PLL_USB_BITS, 0x000000ff
.equ	ACCESSCTRL_PLL_USB_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_USB_DBG
# Description : If 1, PLL_USB can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_PLL_USB_DBG_RESET, 0x1
.equ	ACCESSCTRL_PLL_USB_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_PLL_USB_DBG_MSB, 7
.equ	ACCESSCTRL_PLL_USB_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_USB_DMA
# Description : If 1, PLL_USB can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PLL_USB_DMA_RESET, 0x0
.equ	ACCESSCTRL_PLL_USB_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_PLL_USB_DMA_MSB, 6
.equ	ACCESSCTRL_PLL_USB_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_USB_CORE1
# Description : If 1, PLL_USB can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PLL_USB_CORE1_RESET, 0x1
.equ	ACCESSCTRL_PLL_USB_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_PLL_USB_CORE1_MSB, 5
.equ	ACCESSCTRL_PLL_USB_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_USB_CORE0
# Description : If 1, PLL_USB can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_PLL_USB_CORE0_RESET, 0x1
.equ	ACCESSCTRL_PLL_USB_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_PLL_USB_CORE0_MSB, 4
.equ	ACCESSCTRL_PLL_USB_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_USB_SP
# Description : If 1, PLL_USB can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_PLL_USB_SP_RESET, 0x1
.equ	ACCESSCTRL_PLL_USB_SP_BITS, 0x00000008
.equ	ACCESSCTRL_PLL_USB_SP_MSB, 3
.equ	ACCESSCTRL_PLL_USB_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_USB_SU
# Description : If 1, and SP is also set, PLL_USB can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_PLL_USB_SU_RESET, 0x0
.equ	ACCESSCTRL_PLL_USB_SU_BITS, 0x00000004
.equ	ACCESSCTRL_PLL_USB_SU_MSB, 2
.equ	ACCESSCTRL_PLL_USB_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_USB_NSP
# Description : If 1, PLL_USB can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_PLL_USB_NSP_RESET, 0x0
.equ	ACCESSCTRL_PLL_USB_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_PLL_USB_NSP_MSB, 1
.equ	ACCESSCTRL_PLL_USB_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_PLL_USB_NSU
# Description : If 1, and NSP is also set, PLL_USB can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_PLL_USB_NSU_RESET, 0x0
.equ	ACCESSCTRL_PLL_USB_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_PLL_USB_NSU_MSB, 0
.equ	ACCESSCTRL_PLL_USB_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_TICKS
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               TICKS, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_TICKS_OFFSET, 0x000000d4
.equ	ACCESSCTRL_TICKS_BITS, 0x000000ff
.equ	ACCESSCTRL_TICKS_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TICKS_DBG
# Description : If 1, TICKS can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_TICKS_DBG_RESET, 0x1
.equ	ACCESSCTRL_TICKS_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_TICKS_DBG_MSB, 7
.equ	ACCESSCTRL_TICKS_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TICKS_DMA
# Description : If 1, TICKS can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TICKS_DMA_RESET, 0x0
.equ	ACCESSCTRL_TICKS_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_TICKS_DMA_MSB, 6
.equ	ACCESSCTRL_TICKS_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TICKS_CORE1
# Description : If 1, TICKS can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TICKS_CORE1_RESET, 0x1
.equ	ACCESSCTRL_TICKS_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_TICKS_CORE1_MSB, 5
.equ	ACCESSCTRL_TICKS_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TICKS_CORE0
# Description : If 1, TICKS can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_TICKS_CORE0_RESET, 0x1
.equ	ACCESSCTRL_TICKS_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_TICKS_CORE0_MSB, 4
.equ	ACCESSCTRL_TICKS_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TICKS_SP
# Description : If 1, TICKS can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_TICKS_SP_RESET, 0x1
.equ	ACCESSCTRL_TICKS_SP_BITS, 0x00000008
.equ	ACCESSCTRL_TICKS_SP_MSB, 3
.equ	ACCESSCTRL_TICKS_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TICKS_SU
# Description : If 1, and SP is also set, TICKS can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_TICKS_SU_RESET, 0x0
.equ	ACCESSCTRL_TICKS_SU_BITS, 0x00000004
.equ	ACCESSCTRL_TICKS_SU_MSB, 2
.equ	ACCESSCTRL_TICKS_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TICKS_NSP
# Description : If 1, TICKS can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_TICKS_NSP_RESET, 0x0
.equ	ACCESSCTRL_TICKS_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_TICKS_NSP_MSB, 1
.equ	ACCESSCTRL_TICKS_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_TICKS_NSU
# Description : If 1, and NSP is also set, TICKS can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_TICKS_NSU_RESET, 0x0
.equ	ACCESSCTRL_TICKS_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_TICKS_NSU_MSB, 0
.equ	ACCESSCTRL_TICKS_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_WATCHDOG
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               WATCHDOG, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_WATCHDOG_OFFSET, 0x000000d8
.equ	ACCESSCTRL_WATCHDOG_BITS, 0x000000ff
.equ	ACCESSCTRL_WATCHDOG_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_WATCHDOG_DBG
# Description : If 1, WATCHDOG can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_WATCHDOG_DBG_RESET, 0x1
.equ	ACCESSCTRL_WATCHDOG_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_WATCHDOG_DBG_MSB, 7
.equ	ACCESSCTRL_WATCHDOG_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_WATCHDOG_DMA
# Description : If 1, WATCHDOG can be accessed by the DMA, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_WATCHDOG_DMA_RESET, 0x0
.equ	ACCESSCTRL_WATCHDOG_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_WATCHDOG_DMA_MSB, 6
.equ	ACCESSCTRL_WATCHDOG_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_WATCHDOG_CORE1
# Description : If 1, WATCHDOG can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_WATCHDOG_CORE1_RESET, 0x1
.equ	ACCESSCTRL_WATCHDOG_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_WATCHDOG_CORE1_MSB, 5
.equ	ACCESSCTRL_WATCHDOG_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_WATCHDOG_CORE0
# Description : If 1, WATCHDOG can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_WATCHDOG_CORE0_RESET, 0x1
.equ	ACCESSCTRL_WATCHDOG_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_WATCHDOG_CORE0_MSB, 4
.equ	ACCESSCTRL_WATCHDOG_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_WATCHDOG_SP
# Description : If 1, WATCHDOG can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_WATCHDOG_SP_RESET, 0x1
.equ	ACCESSCTRL_WATCHDOG_SP_BITS, 0x00000008
.equ	ACCESSCTRL_WATCHDOG_SP_MSB, 3
.equ	ACCESSCTRL_WATCHDOG_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_WATCHDOG_SU
# Description : If 1, and SP is also set, WATCHDOG can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_WATCHDOG_SU_RESET, 0x0
.equ	ACCESSCTRL_WATCHDOG_SU_BITS, 0x00000004
.equ	ACCESSCTRL_WATCHDOG_SU_MSB, 2
.equ	ACCESSCTRL_WATCHDOG_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_WATCHDOG_NSP
# Description : If 1, WATCHDOG can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_WATCHDOG_NSP_RESET, 0x0
.equ	ACCESSCTRL_WATCHDOG_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_WATCHDOG_NSP_MSB, 1
.equ	ACCESSCTRL_WATCHDOG_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_WATCHDOG_NSU
# Description : If 1, and NSP is also set, WATCHDOG can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_WATCHDOG_NSU_RESET, 0x0
.equ	ACCESSCTRL_WATCHDOG_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_WATCHDOG_NSU_MSB, 0
.equ	ACCESSCTRL_WATCHDOG_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_RSM
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               RSM, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_RSM_OFFSET, 0x000000dc
.equ	ACCESSCTRL_RSM_BITS, 0x000000ff
.equ	ACCESSCTRL_RSM_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RSM_DBG
# Description : If 1, RSM can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_RSM_DBG_RESET, 0x1
.equ	ACCESSCTRL_RSM_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_RSM_DBG_MSB, 7
.equ	ACCESSCTRL_RSM_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RSM_DMA
# Description : If 1, RSM can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_RSM_DMA_RESET, 0x0
.equ	ACCESSCTRL_RSM_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_RSM_DMA_MSB, 6
.equ	ACCESSCTRL_RSM_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RSM_CORE1
# Description : If 1, RSM can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_RSM_CORE1_RESET, 0x1
.equ	ACCESSCTRL_RSM_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_RSM_CORE1_MSB, 5
.equ	ACCESSCTRL_RSM_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RSM_CORE0
# Description : If 1, RSM can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_RSM_CORE0_RESET, 0x1
.equ	ACCESSCTRL_RSM_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_RSM_CORE0_MSB, 4
.equ	ACCESSCTRL_RSM_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RSM_SP
# Description : If 1, RSM can be accessed from a Secure, Privileged context.
.equ	ACCESSCTRL_RSM_SP_RESET, 0x1
.equ	ACCESSCTRL_RSM_SP_BITS, 0x00000008
.equ	ACCESSCTRL_RSM_SP_MSB, 3
.equ	ACCESSCTRL_RSM_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RSM_SU
# Description : If 1, and SP is also set, RSM can be accessed from a Secure,
#               Unprivileged context.
.equ	ACCESSCTRL_RSM_SU_RESET, 0x0
.equ	ACCESSCTRL_RSM_SU_BITS, 0x00000004
.equ	ACCESSCTRL_RSM_SU_MSB, 2
.equ	ACCESSCTRL_RSM_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RSM_NSP
# Description : If 1, RSM can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_RSM_NSP_RESET, 0x0
.equ	ACCESSCTRL_RSM_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_RSM_NSP_MSB, 1
.equ	ACCESSCTRL_RSM_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_RSM_NSU
# Description : If 1, and NSP is also set, RSM can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_RSM_NSU_RESET, 0x0
.equ	ACCESSCTRL_RSM_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_RSM_NSU_MSB, 0
.equ	ACCESSCTRL_RSM_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_XIP_CTRL
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               XIP_CTRL, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_XIP_CTRL_OFFSET, 0x000000e0
.equ	ACCESSCTRL_XIP_CTRL_BITS, 0x000000ff
.equ	ACCESSCTRL_XIP_CTRL_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_CTRL_DBG
# Description : If 1, XIP_CTRL can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_XIP_CTRL_DBG_RESET, 0x1
.equ	ACCESSCTRL_XIP_CTRL_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_XIP_CTRL_DBG_MSB, 7
.equ	ACCESSCTRL_XIP_CTRL_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_CTRL_DMA
# Description : If 1, XIP_CTRL can be accessed by the DMA, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_XIP_CTRL_DMA_RESET, 0x0
.equ	ACCESSCTRL_XIP_CTRL_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_XIP_CTRL_DMA_MSB, 6
.equ	ACCESSCTRL_XIP_CTRL_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_CTRL_CORE1
# Description : If 1, XIP_CTRL can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XIP_CTRL_CORE1_RESET, 0x1
.equ	ACCESSCTRL_XIP_CTRL_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_XIP_CTRL_CORE1_MSB, 5
.equ	ACCESSCTRL_XIP_CTRL_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_CTRL_CORE0
# Description : If 1, XIP_CTRL can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XIP_CTRL_CORE0_RESET, 0x1
.equ	ACCESSCTRL_XIP_CTRL_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_XIP_CTRL_CORE0_MSB, 4
.equ	ACCESSCTRL_XIP_CTRL_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_CTRL_SP
# Description : If 1, XIP_CTRL can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_XIP_CTRL_SP_RESET, 0x1
.equ	ACCESSCTRL_XIP_CTRL_SP_BITS, 0x00000008
.equ	ACCESSCTRL_XIP_CTRL_SP_MSB, 3
.equ	ACCESSCTRL_XIP_CTRL_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_CTRL_SU
# Description : If 1, and SP is also set, XIP_CTRL can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_XIP_CTRL_SU_RESET, 0x0
.equ	ACCESSCTRL_XIP_CTRL_SU_BITS, 0x00000004
.equ	ACCESSCTRL_XIP_CTRL_SU_MSB, 2
.equ	ACCESSCTRL_XIP_CTRL_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_CTRL_NSP
# Description : If 1, XIP_CTRL can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_XIP_CTRL_NSP_RESET, 0x0
.equ	ACCESSCTRL_XIP_CTRL_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_XIP_CTRL_NSP_MSB, 1
.equ	ACCESSCTRL_XIP_CTRL_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_CTRL_NSU
# Description : If 1, and NSP is also set, XIP_CTRL can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_XIP_CTRL_NSU_RESET, 0x0
.equ	ACCESSCTRL_XIP_CTRL_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_XIP_CTRL_NSU_MSB, 0
.equ	ACCESSCTRL_XIP_CTRL_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_XIP_QMI
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               XIP_QMI, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged processor or debug access only.
#
