konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/accessctrl.inc
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_XIP_QMI_OFFSET, 0x000000e4
.equ	ACCESSCTRL_XIP_QMI_BITS, 0x000000ff
.equ	ACCESSCTRL_XIP_QMI_RESET, 0x000000b8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_QMI_DBG
# Description : If 1, XIP_QMI can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_XIP_QMI_DBG_RESET, 0x1
.equ	ACCESSCTRL_XIP_QMI_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_XIP_QMI_DBG_MSB, 7
.equ	ACCESSCTRL_XIP_QMI_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_QMI_DMA
# Description : If 1, XIP_QMI can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XIP_QMI_DMA_RESET, 0x0
.equ	ACCESSCTRL_XIP_QMI_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_XIP_QMI_DMA_MSB, 6
.equ	ACCESSCTRL_XIP_QMI_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_QMI_CORE1
# Description : If 1, XIP_QMI can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XIP_QMI_CORE1_RESET, 0x1
.equ	ACCESSCTRL_XIP_QMI_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_XIP_QMI_CORE1_MSB, 5
.equ	ACCESSCTRL_XIP_QMI_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_QMI_CORE0
# Description : If 1, XIP_QMI can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XIP_QMI_CORE0_RESET, 0x1
.equ	ACCESSCTRL_XIP_QMI_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_XIP_QMI_CORE0_MSB, 4
.equ	ACCESSCTRL_XIP_QMI_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_QMI_SP
# Description : If 1, XIP_QMI can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_XIP_QMI_SP_RESET, 0x1
.equ	ACCESSCTRL_XIP_QMI_SP_BITS, 0x00000008
.equ	ACCESSCTRL_XIP_QMI_SP_MSB, 3
.equ	ACCESSCTRL_XIP_QMI_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_QMI_SU
# Description : If 1, and SP is also set, XIP_QMI can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_XIP_QMI_SU_RESET, 0x0
.equ	ACCESSCTRL_XIP_QMI_SU_BITS, 0x00000004
.equ	ACCESSCTRL_XIP_QMI_SU_MSB, 2
.equ	ACCESSCTRL_XIP_QMI_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_QMI_NSP
# Description : If 1, XIP_QMI can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_XIP_QMI_NSP_RESET, 0x0
.equ	ACCESSCTRL_XIP_QMI_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_XIP_QMI_NSP_MSB, 1
.equ	ACCESSCTRL_XIP_QMI_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_QMI_NSU
# Description : If 1, and NSP is also set, XIP_QMI can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_XIP_QMI_NSU_RESET, 0x0
.equ	ACCESSCTRL_XIP_QMI_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_XIP_QMI_NSU_MSB, 0
.equ	ACCESSCTRL_XIP_QMI_NSU_LSB, 0
# =============================================================================
# Register    : ACCESSCTRL_XIP_AUX
# Description : Control whether debugger, DMA, core 0 and core 1 can access
#               XIP_AUX, and at what security/privilege levels they can do so.
#
#               Defaults to Secure, Privileged access only.
#
#               This register is writable only from a Secure, Privileged
#               processor or debugger, with the exception of the NSU bit, which
#               becomes Non-secure-Privileged-writable when the NSP bit is set.
.equ	ACCESSCTRL_XIP_AUX_OFFSET, 0x000000e8
.equ	ACCESSCTRL_XIP_AUX_BITS, 0x000000ff
.equ	ACCESSCTRL_XIP_AUX_RESET, 0x000000f8
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_AUX_DBG
# Description : If 1, XIP_AUX can be accessed by the debugger, at
#               security/privilege levels permitted by SP/NSP/SU/NSU in this
#               register.
.equ	ACCESSCTRL_XIP_AUX_DBG_RESET, 0x1
.equ	ACCESSCTRL_XIP_AUX_DBG_BITS, 0x00000080
.equ	ACCESSCTRL_XIP_AUX_DBG_MSB, 7
.equ	ACCESSCTRL_XIP_AUX_DBG_LSB, 7
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_AUX_DMA
# Description : If 1, XIP_AUX can be accessed by the DMA, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XIP_AUX_DMA_RESET, 0x1
.equ	ACCESSCTRL_XIP_AUX_DMA_BITS, 0x00000040
.equ	ACCESSCTRL_XIP_AUX_DMA_MSB, 6
.equ	ACCESSCTRL_XIP_AUX_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_AUX_CORE1
# Description : If 1, XIP_AUX can be accessed by core 1, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XIP_AUX_CORE1_RESET, 0x1
.equ	ACCESSCTRL_XIP_AUX_CORE1_BITS, 0x00000020
.equ	ACCESSCTRL_XIP_AUX_CORE1_MSB, 5
.equ	ACCESSCTRL_XIP_AUX_CORE1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_AUX_CORE0
# Description : If 1, XIP_AUX can be accessed by core 0, at security/privilege
#               levels permitted by SP/NSP/SU/NSU in this register.
.equ	ACCESSCTRL_XIP_AUX_CORE0_RESET, 0x1
.equ	ACCESSCTRL_XIP_AUX_CORE0_BITS, 0x00000010
.equ	ACCESSCTRL_XIP_AUX_CORE0_MSB, 4
.equ	ACCESSCTRL_XIP_AUX_CORE0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_AUX_SP
# Description : If 1, XIP_AUX can be accessed from a Secure, Privileged
#               context.
.equ	ACCESSCTRL_XIP_AUX_SP_RESET, 0x1
.equ	ACCESSCTRL_XIP_AUX_SP_BITS, 0x00000008
.equ	ACCESSCTRL_XIP_AUX_SP_MSB, 3
.equ	ACCESSCTRL_XIP_AUX_SP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_AUX_SU
# Description : If 1, and SP is also set, XIP_AUX can be accessed from a
#               Secure, Unprivileged context.
.equ	ACCESSCTRL_XIP_AUX_SU_RESET, 0x0
.equ	ACCESSCTRL_XIP_AUX_SU_BITS, 0x00000004
.equ	ACCESSCTRL_XIP_AUX_SU_MSB, 2
.equ	ACCESSCTRL_XIP_AUX_SU_LSB, 2
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_AUX_NSP
# Description : If 1, XIP_AUX can be accessed from a Non-secure, Privileged
#               context.
.equ	ACCESSCTRL_XIP_AUX_NSP_RESET, 0x0
.equ	ACCESSCTRL_XIP_AUX_NSP_BITS, 0x00000002
.equ	ACCESSCTRL_XIP_AUX_NSP_MSB, 1
.equ	ACCESSCTRL_XIP_AUX_NSP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : ACCESSCTRL_XIP_AUX_NSU
# Description : If 1, and NSP is also set, XIP_AUX can be accessed from a Non-
#               secure, Unprivileged context.
#
#               This bit is writable from a Non-secure, Privileged context, if
#               and only if the NSP bit is set.
.equ	ACCESSCTRL_XIP_AUX_NSU_RESET, 0x0
.equ	ACCESSCTRL_XIP_AUX_NSU_BITS, 0x00000001
.equ	ACCESSCTRL_XIP_AUX_NSU_MSB, 0
.equ	ACCESSCTRL_XIP_AUX_NSU_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_ACCESSCTRL_H
